levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32f4a8_ll_interrupts_share.c
/**
 *******************************************************************************
 * @file  hc32f4a8_ll_interrupts_share.c
 * @brief This file provides firmware functions to manage the Share Interrupt
 *        Controller (SHARE_INTERRUPTS).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-13       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2025, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a8_ll_interrupts_share.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_HC32F4A8_SHARE_INTERRUPTS SHARE_INTERRUPTS
 * @brief Share Interrupts Driver Library
 * @{
 */

#if (LL_INTERRUPTS_SHARE_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup Share_Interrupts_Global_Functions Share Interrupts Global Functions
 * @{
 */
/**
 * @brief  Share IRQ configure
 * @param  [in] enIntSrc: Peripheral interrupt source @ref en_int_src_t
 * @param  [in] enNewState: An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Share IRQ configure successfully
 */
int32_t INTC_ShareIrqCmd(en_int_src_t enIntSrc, en_functional_state_t enNewState)
{
    __IO uint32_t *INTC_VSSELx;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    INTC_VSSELx = (__IO uint32_t *)(((uint32_t)&CM_INTC->VSSEL128) + (4U * ((uint32_t)enIntSrc / 0x20U)));
    if (ENABLE == enNewState) {
        SET_REG32_BIT(*INTC_VSSELx, (1UL << ((uint32_t)enIntSrc & 0x1FUL)));
    } else {
        CLR_REG32_BIT(*INTC_VSSELx, (1UL << ((uint32_t)enIntSrc & 0x1FUL)));
    }
    return LL_OK;
}

/**
 * @brief  Interrupt No.128 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ128_Handler(void)
{
    const uint32_t VSSEL128 = CM_INTC->VSSEL128;

    /* external interrupt 00 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR0) && (0UL != (VSSEL128 & BIT_MASK_00))) {
        EXTINT00_IrqHandler();
    }
    /* external interrupt 01 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR1) && (0UL != (VSSEL128 & BIT_MASK_01))) {
        EXTINT01_IrqHandler();
    }
    /* external interrupt 02 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR2) && (0UL != (VSSEL128 & BIT_MASK_02))) {
        EXTINT02_IrqHandler();
    }
    /* external interrupt 03 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR3) && (0UL != (VSSEL128 & BIT_MASK_03))) {
        EXTINT03_IrqHandler();
    }
    /* external interrupt 04 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR4) && (0UL != (VSSEL128 & BIT_MASK_04))) {
        EXTINT04_IrqHandler();
    }
    /* external interrupt 05 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR5) && (0UL != (VSSEL128 & BIT_MASK_05))) {
        EXTINT05_IrqHandler();
    }
    /* external interrupt 06 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR6) && (0UL != (VSSEL128 & BIT_MASK_06))) {
        EXTINT06_IrqHandler();
    }
    /* external interrupt 07 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR7) && (0UL != (VSSEL128 & BIT_MASK_07))) {
        EXTINT07_IrqHandler();
    }
    /* external interrupt 08 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR8) && (0UL != (VSSEL128 & BIT_MASK_08))) {
        EXTINT08_IrqHandler();
    }
    /* external interrupt 09 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR9) && (0UL != (VSSEL128 & BIT_MASK_09))) {
        EXTINT09_IrqHandler();
    }
    /* external interrupt 10 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR10) && (0UL != (VSSEL128 & BIT_MASK_10))) {
        EXTINT10_IrqHandler();
    }
    /* external interrupt 11 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR11) && (0UL != (VSSEL128 & BIT_MASK_11))) {
        EXTINT11_IrqHandler();
    }
    /* external interrupt 12 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR12) && (0UL != (VSSEL128 & BIT_MASK_12))) {
        EXTINT12_IrqHandler();
    }
    /* external interrupt 13 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR13) && (0UL != (VSSEL128 & BIT_MASK_13))) {
        EXTINT13_IrqHandler();
    }
    /* external interrupt 14 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR14) && (0UL != (VSSEL128 & BIT_MASK_14))) {
        EXTINT14_IrqHandler();
    }
    /* external interrupt 15 */
    if ((1UL == bCM_INTC->EIFR_b.EIFR15) && (0UL != (VSSEL128 & BIT_MASK_15))) {
        EXTINT15_IrqHandler();
    }
    /* Timer0 unit3, Ch.A compare match */
    if (1UL == bCM_TMR0_3->BCONR_b.CMENA) {
        if ((1UL == bCM_TMR0_3->STFLR_b.CMFA) && (0UL != (VSSEL128 & BIT_MASK_16))) {
            TMR0_3_CmpA_IrqHandler();
        }
    }
    /* Timer0 unit3, Ch.B compare match */
    if (1UL == bCM_TMR0_3->BCONR_b.CMENB) {
        if ((1UL == bCM_TMR0_3->STFLR_b.CMFB) && (0UL != (VSSEL128 & BIT_MASK_17))) {
            TMR0_3_CmpB_IrqHandler();
        }
    }
    /* Timer0 unit4, Ch.A compare match */
    if (1UL == bCM_TMR0_4->BCONR_b.CMENA) {
        if ((1UL == bCM_TMR0_4->STFLR_b.CMFA) && (0UL != (VSSEL128 & BIT_MASK_18))) {
            TMR0_4_CmpA_IrqHandler();
        }
    }
    /* Timer0 unit4, Ch.B compare match */
    if (1UL == bCM_TMR0_4->BCONR_b.CMENB) {
        if ((1UL == bCM_TMR0_4->STFLR_b.CMFB) && (0UL != (VSSEL128 & BIT_MASK_19))) {
            TMR0_4_CmpB_IrqHandler();
        }
    }
    /* Timer0 unit5, Ch.A compare match */
    if (1UL == bCM_TMR0_5->BCONR_b.CMENA) {
        if ((1UL == bCM_TMR0_5->STFLR_b.CMFA) && (0UL != (VSSEL128 & BIT_MASK_20))) {
            TMR0_5_CmpA_IrqHandler();
        }
    }
    /* Timer0 unit5, Ch.B compare match */
    if (1UL == bCM_TMR0_5->BCONR_b.CMENB) {
        if ((1UL == bCM_TMR0_5->STFLR_b.CMFB) && (0UL != (VSSEL128 & BIT_MASK_21))) {
            TMR0_5_CmpB_IrqHandler();
        }
    }

    /* Timer0 unit1, Ch.A overflow */
    if (1UL == bCM_TMR0_1->BCONR_b.OVENA) {
        if ((1UL == bCM_TMR0_1->STFLR_b.OVFA) && (0UL != (VSSEL128 & BIT_MASK_22))) {
            TMR0_1_OvfA_IrqHandler();
        }
    }
    /* Timer0 unit1, Ch.B overflow */
    if (1UL == bCM_TMR0_1->BCONR_b.OVENB) {
        if ((1UL == bCM_TMR0_1->STFLR_b.OVFB) && (0UL != (VSSEL128 & BIT_MASK_23))) {
            TMR0_1_OvfB_IrqHandler();
        }
    }
    /* Timer0 unit2, Ch.A overflow */
    if (1UL == bCM_TMR0_2->BCONR_b.OVENA) {
        if ((1UL == bCM_TMR0_2->STFLR_b.OVFA) && (0UL != (VSSEL128 & BIT_MASK_24))) {
            TMR0_2_OvfA_IrqHandler();
        }
    }
    /* Timer0 unit2, Ch.B overflow */
    if (1UL == bCM_TMR0_2->BCONR_b.OVENB) {
        if ((1UL == bCM_TMR0_2->STFLR_b.OVFB) && (0UL != (VSSEL128 & BIT_MASK_25))) {
            TMR0_2_OvfB_IrqHandler();
        }
    }
    /* Timer0 unit3, Ch.A overflow */
    if (1UL == bCM_TMR0_3->BCONR_b.OVENA) {
        if ((1UL == bCM_TMR0_3->STFLR_b.OVFA) && (0UL != (VSSEL128 & BIT_MASK_26))) {
            TMR0_3_OvfA_IrqHandler();
        }
    }
    /* Timer0 unit3, Ch.B overflow */
    if (1UL == bCM_TMR0_3->BCONR_b.OVENB) {
        if ((1UL == bCM_TMR0_3->STFLR_b.OVFB) && (0UL != (VSSEL128 & BIT_MASK_27))) {
            TMR0_3_OvfB_IrqHandler();
        }
    }
    /* Timer0 unit4, Ch.A overflow */
    if (1UL == bCM_TMR0_4->BCONR_b.OVENA) {
        if ((1UL == bCM_TMR0_4->STFLR_b.OVFA) && (0UL != (VSSEL128 & BIT_MASK_28))) {
            TMR0_4_OvfA_IrqHandler();
        }
    }
    /* Timer0 unit4, Ch.B overflow */
    if (1UL == bCM_TMR0_4->BCONR_b.OVENB) {
        if ((1UL == bCM_TMR0_4->STFLR_b.OVFB) && (0UL != (VSSEL128 & BIT_MASK_29))) {
            TMR0_4_OvfB_IrqHandler();
        }
    }
    /* Timer0 unit5, Ch.A overflow */
    if (1UL == bCM_TMR0_5->BCONR_b.OVENA) {
        if ((1UL == bCM_TMR0_5->STFLR_b.OVFA) && (0UL != (VSSEL128 & BIT_MASK_30))) {
            TMR0_5_OvfA_IrqHandler();
        }
    }
    /* Timer0 unit5, Ch.B overflow */
    if (1UL == bCM_TMR0_5->BCONR_b.OVENB) {
        if ((1UL == bCM_TMR0_5->STFLR_b.OVFB) && (0UL != (VSSEL128 & BIT_MASK_31))) {
            TMR0_5_OvfB_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.129 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ129_Handler(void)
{
    const uint32_t VSSEL129 = CM_INTC->VSSEL129;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* DMA1 Ch.0 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL0_b.IE) {
        /* DMA1 Ch.0 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC0) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC0) && (0UL != (VSSEL129 & BIT_MASK_00))) {
                DMA1_TC0_IrqHandler();
            }
        }
        /* DMA1 ch.0 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC0) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC0) && (0UL != (VSSEL129 & BIT_MASK_08))) {
                DMA1_BTC0_IrqHandler();
            }
        }
        /* DMA1 ch.0 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_00 | BIT_MASK_16);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_00 | BIT_MASK_16));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error0_IrqHandler();
        }
    }
    /* DMA1 Ch.1 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL1_b.IE) {
        /* DMA1 Ch.1 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC1) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC1) && (0UL != (VSSEL129 & BIT_MASK_01))) {
                DMA1_TC1_IrqHandler();
            }
        }
        /* DMA1 ch.1 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC1) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC1) && (0UL != (VSSEL129 & BIT_MASK_09))) {
                DMA1_BTC1_IrqHandler();
            }
        }
        /* DMA1 ch.1 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_01 | BIT_MASK_17);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_01 | BIT_MASK_17));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error1_IrqHandler();
        }
    }
    /* DMA1 Ch.2 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL2_b.IE) {
        /* DMA1 Ch.2 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC2) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC2) && (0UL != (VSSEL129 & BIT_MASK_02))) {
                DMA1_TC2_IrqHandler();
            }
        }
        /* DMA1 ch.2 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC2) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC2) && (0UL != (VSSEL129 & BIT_MASK_10))) {
                DMA1_BTC2_IrqHandler();
            }
        }
        /* DMA1 ch.2 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_02 | BIT_MASK_18);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_02 | BIT_MASK_18));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error2_IrqHandler();
        }
    }
    /* DMA1 Ch.3 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL3_b.IE) {
        /* DMA1 Ch.3 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC3) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC3) && (0UL != (VSSEL129 & BIT_MASK_03))) {
                DMA1_TC3_IrqHandler();
            }
        }
        /* DMA1 ch.3 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC3) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC3) && (0UL != (VSSEL129 & BIT_MASK_11))) {
                DMA1_BTC3_IrqHandler();
            }
        }
        /* DMA1 ch.3 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_03 | BIT_MASK_19);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_03 | BIT_MASK_19));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error3_IrqHandler();
        }
    }
    /* DMA1 Ch.4 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL4_b.IE) {
        /* DMA1 Ch.4 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC4) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC4) && (0UL != (VSSEL129 & BIT_MASK_04))) {
                DMA1_TC4_IrqHandler();
            }
        }
        /* DMA1 ch.4 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC4) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC4) && (0UL != (VSSEL129 & BIT_MASK_12))) {
                DMA1_BTC4_IrqHandler();
            }
        }
        /* DMA1 ch.4 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_04 | BIT_MASK_20);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_04 | BIT_MASK_20));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error4_IrqHandler();
        }
    }
    /* DMA1 Ch.5 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL5_b.IE) {
        /* DMA1 Ch.5 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC5) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC5) && (0UL != (VSSEL129 & BIT_MASK_05))) {
                DMA1_TC5_IrqHandler();
            }
        }
        /* DMA1 ch.5 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC5) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC5) && (0UL != (VSSEL129 & BIT_MASK_13))) {
                DMA1_BTC5_IrqHandler();
            }
        }
        /* DMA1 ch.5 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_05 | BIT_MASK_21);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_05 | BIT_MASK_21));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error5_IrqHandler();
        }
    }
    /* DMA1 Ch.6 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL6_b.IE) {
        /* DMA1 Ch.6 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC6) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC6) && (0UL != (VSSEL129 & BIT_MASK_06))) {
                DMA1_TC6_IrqHandler();
            }
        }
        /* DMA1 ch.6 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC6) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC6) && (0UL != (VSSEL129 & BIT_MASK_14))) {
                DMA1_BTC6_IrqHandler();
            }
        }
        /* DMA1 ch.6 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_06 | BIT_MASK_22);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_06 | BIT_MASK_22));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error6_IrqHandler();
        }
    }
    /* DMA1 Ch.7 interrupt enabled */
    if (1UL == bCM_DMA1->CHCTL7_b.IE) {
        /* DMA1 Ch.7 Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKTC7) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.TC7) && (0UL != (VSSEL129 & BIT_MASK_07))) {
                DMA1_TC7_IrqHandler();
            }
        }
        /* DMA1 ch.7 Block Tx completed */
        if (0UL == bCM_DMA1->INTMASK1_b.MSKBTC7) {
            if ((1UL == bCM_DMA1->INTSTAT1_b.BTC7) && (0UL != (VSSEL129 & BIT_MASK_15))) {
                DMA1_BTC7_IrqHandler();
            }
        }
        /* DMA1 ch.7 Transfer/Request Error */
        u32Tmp1 = CM_DMA1->INTSTAT0 & (BIT_MASK_07 | BIT_MASK_22);
        u32Tmp2 = (uint32_t)(~(CM_DMA1->INTMASK0) & (BIT_MASK_07 | BIT_MASK_22));
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL129 & BIT_MASK_16))) {
            DMA1_Error7_IrqHandler();
        }
    }
    /* EFM error */
    if (1UL == bCM_EFM->FITE_b.PEERRITE) {
        /* EFM program/erase/protect/otp error */
        u32Tmp1 = CM_EFM->FSR & (EFM_FSR_PRTWERR0 | EFM_FSR_PGSZERR0 | EFM_FSR_MISMTCH0 |    \
                                 EFM_FSR_PRTWERR1 | EFM_FSR_PGSZERR1 | EFM_FSR_MISMTCH1 |    \
                                 EFM_FSR_OTPWERR0);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_17))) {
            EFM_ProgramEraseError_IrqHandler();
        }
    }
    /* EFM read collision error*/
    if (1UL == bCM_EFM->FITE_b.COLERRITE) {
        /* EFM read collision */
        u32Tmp1 = CM_EFM->FSR & (EFM_FSR_COLERR0 | EFM_FSR_COLERR1);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_18))) {
            EFM_ColError_IrqHandler();
        }
    }
    /* EFM operate end */
    if (1UL == bCM_EFM->FITE_b.OPTENDITE) {
        /* EFM operate end */
        u32Tmp1 = CM_EFM->FSR & (EFM_FSR_OPTEND0 | EFM_FSR_OPTEND1);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_19))) {
            EFM_OpEnd_IrqHandler();
        }
    }
    /* QSPI access error */
    u32Tmp1 = CM_QSPI->SR & QSPI_SR_RAER;
    if ((0UL != u32Tmp1) && (0UL != (VSSEL129 & BIT_MASK_22))) {
        QSPI_Error_IrqHandler();
    }
    /*DCU1 */
    if (1UL == bCM_DCU1->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU1->INTEVTSEL;
        u32Tmp2 = CM_DCU1->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_23))) {
            DCU1_IrqHandler();
        }
    }
    /*DCU2 */
    if (1UL == bCM_DCU2->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU2->INTEVTSEL;
        u32Tmp2 = CM_DCU2->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_24))) {
            DCU2_IrqHandler();
        }
    }
    /*DCU3 */
    if (1UL == bCM_DCU3->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU3->INTEVTSEL;
        u32Tmp2 = CM_DCU3->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_25))) {
            DCU3_IrqHandler();
        }
    }
    /*DCU4 */
    if (1UL == bCM_DCU4->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU4->INTEVTSEL;
        u32Tmp2 = CM_DCU4->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_26))) {
            DCU4_IrqHandler();
        }
    }
    /*DCU5 */
    if (1UL == bCM_DCU5->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU5->INTEVTSEL;
        u32Tmp2 = CM_DCU5->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_27))) {
            DCU5_IrqHandler();
        }
    }
    /*DCU6 */
    if (1UL == bCM_DCU6->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU6->INTEVTSEL;
        u32Tmp2 = CM_DCU6->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_28))) {
            DCU6_IrqHandler();
        }
    }
    /*DCU7 */
    if (1UL == bCM_DCU7->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU7->INTEVTSEL;
        u32Tmp2 = CM_DCU7->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_29))) {
            DCU7_IrqHandler();
        }
    }
    /*DCU8 */
    if (1UL == bCM_DCU8->CTL_b.INTEN) {
        u32Tmp1 = CM_DCU8->INTEVTSEL;
        u32Tmp2 = CM_DCU8->FLAG;
        if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0E7FUL)) && (0UL != (VSSEL129 & BIT_MASK_30))) {
            DCU8_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.130 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ130_Handler(void)
{
    const uint32_t VSSEL130 = CM_INTC->VSSEL130;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

