levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32f4a8_ll_interrupts_share.c
    /* Timer6 Unit.1 general compare match A */
    if (1UL == bCM_TMR6_1->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMAF) && (0UL != (VSSEL132 & BIT_MASK_00))) {
            TMR6_1_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.1 general compare match B */
    if (1UL == bCM_TMR6_1->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMBF) && (0UL != (VSSEL132 & BIT_MASK_01))) {
            TMR6_1_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.1 general compare match C */
    if (1UL == bCM_TMR6_1->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMCF) && (0UL != (VSSEL132 & BIT_MASK_02))) {
            TMR6_1_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.1 general compare match D */
    if (1UL == bCM_TMR6_1->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMDF) && (0UL != (VSSEL132 & BIT_MASK_03))) {
            TMR6_1_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.1 general compare match E */
    if (1UL == bCM_TMR6_1->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMEF) && (0UL != (VSSEL132 & BIT_MASK_04))) {
            TMR6_1_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.1 general compare match F */
    if (1UL == bCM_TMR6_1->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMFF) && (0UL != (VSSEL132 & BIT_MASK_05))) {
            TMR6_1_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.1 overflow*/
    if (1UL == bCM_TMR6_1->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_1->STFLR_b.OVFF) && (0UL != (VSSEL132 & BIT_MASK_06))) {
            TMR6_1_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.1 underflow*/
    if (1UL == bCM_TMR6_1->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_1->STFLR_b.UDFF) && (0UL != (VSSEL132 & BIT_MASK_07))) {
            TMR6_1_GUdf_IrqHandler();
        }
    }
    /* Timer4 Unit.1 U phase higher compare match */
    if (1UL == bCM_TMR4_1->OCSRU_b.OCIEH) {
        if ((1UL == bCM_TMR4_1->OCSRU_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_08))) {
            TMR4_1_GCmpUH_IrqHandler();
        }
    }
    /* Timer4 Unit.1 U phase lower compare match */
    if (1UL == bCM_TMR4_1->OCSRU_b.OCIEL) {
        if ((1UL == bCM_TMR4_1->OCSRU_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_09))) {
            TMR4_1_GCmpUL_IrqHandler();
        }
    }
    /* Timer4 Unit.1 V phase higher compare match */
    if (1UL == bCM_TMR4_1->OCSRV_b.OCIEH) {
        if ((1UL == bCM_TMR4_1->OCSRV_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_10))) {
            TMR4_1_GCmpVH_IrqHandler();
        }
    }
    /* Timer4 Unit.1 V phase lower compare match */
    if (1UL == bCM_TMR4_1->OCSRV_b.OCIEL) {
        if ((1UL == bCM_TMR4_1->OCSRV_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_11))) {
            TMR4_1_GCmpVL_IrqHandler();
        }
    }
    /* Timer4 Unit.1 W phase higher compare match */
    if (1UL == bCM_TMR4_1->OCSRW_b.OCIEH) {
        if ((1UL == bCM_TMR4_1->OCSRW_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_12))) {
            TMR4_1_GCmpWH_IrqHandler();
        }
    }
    /* Timer4 Unit.1 W phase lower compare match */
    if (1UL == bCM_TMR4_1->OCSRW_b.OCIEL) {
        if ((1UL == bCM_TMR4_1->OCSRW_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_13))) {
            TMR4_1_GCmpWL_IrqHandler();
        }
    }
    /* Timer4 Unit.1 overflow */
    if (1UL == bCM_TMR4_1->CCSR_b.IRQPEN) {
        if ((1UL == bCM_TMR4_1->CCSR_b.IRQPF) && (0UL != (VSSEL132 & BIT_MASK_14))) {
            TMR4_1_Ovf_IrqHandler();
        }
    }
    /* Timer4 Unit.1 underflow */
    if (1UL == bCM_TMR4_1->CCSR_b.IRQZEN) {
        if ((1UL == bCM_TMR4_1->CCSR_b.IRQZF) && (0UL != (VSSEL132 & BIT_MASK_15))) {
            TMR4_1_Udf_IrqHandler();
        }
    }
    /* Timer6 Unit.2 general compare match A */
    if (1UL == bCM_TMR6_2->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMAF) && (0UL != (VSSEL132 & BIT_MASK_16))) {
            TMR6_2_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.2 general compare match B */
    if (1UL == bCM_TMR6_2->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMBF) && (0UL != (VSSEL132 & BIT_MASK_17))) {
            TMR6_2_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.2 general compare match C */
    if (1UL == bCM_TMR6_2->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMCF) && (0UL != (VSSEL132 & BIT_MASK_18))) {
            TMR6_2_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.2 general compare match D */
    if (1UL == bCM_TMR6_2->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMDF) && (0UL != (VSSEL132 & BIT_MASK_19))) {
            TMR6_2_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.2 general compare match E */
    if (1UL == bCM_TMR6_2->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMEF) && (0UL != (VSSEL132 & BIT_MASK_20))) {
            TMR6_2_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.2 general compare match F */
    if (1UL == bCM_TMR6_2->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMFF) && (0UL != (VSSEL132 & BIT_MASK_21))) {
            TMR6_2_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.2 overflow*/
    if (1UL == bCM_TMR6_2->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_2->STFLR_b.OVFF) && (0UL != (VSSEL132 & BIT_MASK_22))) {
            TMR6_2_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.2 underflow*/
    if (1UL == bCM_TMR6_2->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_2->STFLR_b.UDFF) && (0UL != (VSSEL132 & BIT_MASK_23))) {
            TMR6_2_GUdf_IrqHandler();
        }
    }
    /* Timer4 Unit.2 U phase higher compare match */
    if (1UL == bCM_TMR4_2->OCSRU_b.OCIEH) {
        if ((1UL == bCM_TMR4_2->OCSRU_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_24))) {
            TMR4_2_GCmpUH_IrqHandler();
        }
    }
    /* Timer4 Unit.2 U phase lower compare match */
    if (1UL == bCM_TMR4_2->OCSRU_b.OCIEL) {
        if ((1UL == bCM_TMR4_2->OCSRU_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_25))) {
            TMR4_2_GCmpUL_IrqHandler();
        }
    }
    /* Timer4 Unit.2 V phase higher compare match */
    if (1UL == bCM_TMR4_2->OCSRV_b.OCIEH) {
        if ((1UL == bCM_TMR4_2->OCSRV_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_26))) {
            TMR4_2_GCmpVH_IrqHandler();
        }
    }
    /* Timer4 Unit.2 V phase lower compare match */
    if (1UL == bCM_TMR4_2->OCSRV_b.OCIEL) {
        if ((1UL == bCM_TMR4_2->OCSRV_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_27))) {
            TMR4_2_GCmpVL_IrqHandler();
        }
    }
    /* Timer4 Unit.2 W phase higher compare match */
    if (1UL == bCM_TMR4_2->OCSRW_b.OCIEH) {
        if ((1UL == bCM_TMR4_2->OCSRW_b.OCFH) && (0UL != (VSSEL132 & BIT_MASK_28))) {
            TMR4_2_GCmpWH_IrqHandler();
        }
    }
    /* Timer4 Unit.2 W phase lower compare match */
    if (1UL == bCM_TMR4_2->OCSRW_b.OCIEL) {
        if ((1UL == bCM_TMR4_2->OCSRW_b.OCFL) && (0UL != (VSSEL132 & BIT_MASK_29))) {
            TMR4_2_GCmpWL_IrqHandler();
        }
    }
    /* Timer4 Unit.2 overflow */
    if (1UL == bCM_TMR4_2->CCSR_b.IRQPEN) {
        if ((1UL == bCM_TMR4_2->CCSR_b.IRQPF) && (0UL != (VSSEL132 & BIT_MASK_30))) {
            TMR4_2_Ovf_IrqHandler();
        }
    }
    /* Timer4 Unit.2 underflow */
    if (1UL == bCM_TMR4_2->CCSR_b.IRQZEN) {
        if ((1UL == bCM_TMR4_2->CCSR_b.IRQZF) && (0UL != (VSSEL132 & BIT_MASK_31))) {
            TMR4_2_Udf_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.133 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ133_Handler(void)
{
    const uint32_t VSSEL133 = CM_INTC->VSSEL133;

    /* Timer6 Unit.3 general compare match A */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMAF) && (0UL != (VSSEL133 & BIT_MASK_00))) {
            TMR6_3_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.3 general compare match B */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMBF) && (0UL != (VSSEL133 & BIT_MASK_01))) {
            TMR6_3_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.3 general compare match C */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMCF) && (0UL != (VSSEL133 & BIT_MASK_02))) {
            TMR6_3_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.3 general compare match D */
    if (1UL == bCM_TMR6_3->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMDF) && (0UL != (VSSEL133 & BIT_MASK_03))) {
            TMR6_3_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.3 general compare match E */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMEF) && (0UL != (VSSEL133 & BIT_MASK_04))) {
            TMR6_3_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.3 general compare match F */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMFF) && (0UL != (VSSEL133 & BIT_MASK_05))) {
            TMR6_3_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.3 overflow*/
    if (1UL == bCM_TMR6_3->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_3->STFLR_b.OVFF) && (0UL != (VSSEL133 & BIT_MASK_06))) {
            TMR6_3_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.3 underflow*/
    if (1UL == bCM_TMR6_3->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_3->STFLR_b.UDFF) && (0UL != (VSSEL133 & BIT_MASK_07))) {
            TMR6_3_GUdf_IrqHandler();
        }
    }
    /* Timer4 Unit.3 U phase higher compare match */
    if (1UL == bCM_TMR4_3->OCSRU_b.OCIEH) {
        if ((1UL == bCM_TMR4_3->OCSRU_b.OCFH) && (0UL != (VSSEL133 & BIT_MASK_08))) {
            TMR4_3_GCmpUH_IrqHandler();
        }
    }
    /* Timer4 Unit.3 U phase lower compare match */
    if (1UL == bCM_TMR4_3->OCSRU_b.OCIEL) {
        if ((1UL == bCM_TMR4_3->OCSRU_b.OCFL) && (0UL != (VSSEL133 & BIT_MASK_09))) {
            TMR4_3_GCmpUL_IrqHandler();
        }
    }
    /* Timer4 Unit.3 V phase higher compare match */
    if (1UL == bCM_TMR4_3->OCSRV_b.OCIEH) {
        if ((1UL == bCM_TMR4_3->OCSRV_b.OCFH) && (0UL != (VSSEL133 & BIT_MASK_10))) {
            TMR4_3_GCmpVH_IrqHandler();
        }
    }
    /* Timer4 Unit.3 V phase lower compare match */
    if (1UL == bCM_TMR4_3->OCSRV_b.OCIEL) {
        if ((1UL == bCM_TMR4_3->OCSRV_b.OCFL) && (0UL != (VSSEL133 & BIT_MASK_11))) {
            TMR4_3_GCmpVL_IrqHandler();
        }
    }
    /* Timer4 Unit.3 W phase higher compare match */
    if (1UL == bCM_TMR4_3->OCSRW_b.OCIEH) {
        if ((1UL == bCM_TMR4_3->OCSRW_b.OCFH) && (0UL != (VSSEL133 & BIT_MASK_12))) {
            TMR4_3_GCmpWH_IrqHandler();
        }
    }
    /* Timer4 Unit.3 W phase lower compare match */
    if (1UL == bCM_TMR4_3->OCSRW_b.OCIEL) {
        if ((1UL == bCM_TMR4_3->OCSRW_b.OCFL) && (0UL != (VSSEL133 & BIT_MASK_13))) {
            TMR4_3_GCmpWL_IrqHandler();
        }
    }
    /* Timer4 Unit.3 overflow */
    if (1UL == bCM_TMR4_3->CCSR_b.IRQPEN) {
        if ((1UL == bCM_TMR4_3->CCSR_b.IRQPF) && (0UL != (VSSEL133 & BIT_MASK_14))) {
            TMR4_3_Ovf_IrqHandler();
        }
    }
    /* Timer4 Unit.3 underflow */
    if (1UL == bCM_TMR4_3->CCSR_b.IRQZEN) {
        if ((1UL == bCM_TMR4_3->CCSR_b.IRQZF) && (0UL != (VSSEL133 & BIT_MASK_15))) {
            TMR4_3_Udf_IrqHandler();
        }
    }
    /* Timer6 Unit.1 dead time */
    if (1UL == bCM_TMR6_1->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_1->STFLR_b.DTEF) && (0UL != (VSSEL133 & BIT_MASK_16))) {
            TMR6_1_GDte_IrqHandler();
        }
    }
    /* Timer6 Unit.1 specified up compare match A*/
    if (1UL == bCM_TMR6_1->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMSAUF) && (0UL != (VSSEL133 & BIT_MASK_19))) {
            TMR6_1_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.1 specified down compare match A*/
    if (1UL == bCM_TMR6_1->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMSADF) && (0UL != (VSSEL133 & BIT_MASK_19))) {
            TMR6_1_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.1 specified up compare match B*/
    if (1UL == bCM_TMR6_1->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMSBUF) && (0UL != (VSSEL133 & BIT_MASK_20))) {
            TMR6_1_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.1 specified down compare match B*/
    if (1UL == bCM_TMR6_1->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_1->STFLR_b.CMSBDF) && (0UL != (VSSEL133 & BIT_MASK_20))) {
            TMR6_1_SCmpDownB_IrqHandler();
        }
    }
    /* Timer4 Unit.1 U phase reload */
    if (0UL == bCM_TMR4_1->RCSR_b.RTIDU) {
        if ((1UL == bCM_TMR4_1->RCSR_b.RTIFU) && (0UL != (VSSEL133 & BIT_MASK_21))) {
            TMR4_1_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Unit.1 V phase reload */
    if (0UL == bCM_TMR4_1->RCSR_b.RTIDV) {
        if ((1UL == bCM_TMR4_1->RCSR_b.RTIFV) && (0UL != (VSSEL133 & BIT_MASK_22))) {
            TMR4_1_ReloadV_IrqHandler();
        }
    }
    /* Timer4 Unit.1 W phase reload */
    if (0UL == bCM_TMR4_1->RCSR_b.RTIDW) {
        if ((1UL == bCM_TMR4_1->RCSR_b.RTIFW) && (0UL != (VSSEL133 & BIT_MASK_23))) {
            TMR4_1_ReloadW_IrqHandler();
        }
    }
    /* Timer6 Unit.2 dead time */
    if (1UL == bCM_TMR6_2->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_2->STFLR_b.DTEF) && (0UL != (VSSEL133 & BIT_MASK_24))) {
            TMR6_2_GDte_IrqHandler();
        }
    }
    /* Timer6 Unit.2 specified up compare match A*/
    if (1UL == bCM_TMR6_2->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMSAUF) && (0UL != (VSSEL133 & BIT_MASK_27))) {
            TMR6_2_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.2 specified down compare match A*/
    if (1UL == bCM_TMR6_2->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMSADF) && (0UL != (VSSEL133 & BIT_MASK_27))) {
            TMR6_2_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.2 specified up compare match B*/
    if (1UL == bCM_TMR6_2->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMSBUF) && (0UL != (VSSEL133 & BIT_MASK_28))) {
            TMR6_2_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.2 specified down compare match B*/
    if (1UL == bCM_TMR6_2->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_2->STFLR_b.CMSBDF) && (0UL != (VSSEL133 & BIT_MASK_28))) {
            TMR6_2_SCmpDownB_IrqHandler();
        }
    }
    /* Timer4 Unit.2 U phase reload */
    if (0UL == bCM_TMR4_2->RCSR_b.RTIDU) {
        if ((1UL == bCM_TMR4_2->RCSR_b.RTIFU) && (0UL != (VSSEL133 & BIT_MASK_29))) {
            TMR4_2_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Unit.2 V phase reload */
    if (0UL == bCM_TMR4_2->RCSR_b.RTIDV) {
        if ((1UL == bCM_TMR4_2->RCSR_b.RTIFV) && (0UL != (VSSEL133 & BIT_MASK_30))) {
            TMR4_2_ReloadV_IrqHandler();
        }
    }
    /* Timer4 Unit.2 W phase reload */
    if (0UL == bCM_TMR4_2->RCSR_b.RTIDW) {
        if ((1UL == bCM_TMR4_2->RCSR_b.RTIFW) && (0UL != (VSSEL133 & BIT_MASK_31))) {
            TMR4_2_ReloadW_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.134 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ134_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    const uint32_t VSSEL134 = CM_INTC->VSSEL134;

    /* Timer6 Unit.3 dead time */
    if (1UL == bCM_TMR6_3->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_3->STFLR_b.DTEF) && (0UL != (VSSEL134 & BIT_MASK_00))) {
            TMR6_3_GDte_IrqHandler();
        }
    }
    /* Timer6 Unit.3 specified up compare match A*/
    if (1UL == bCM_TMR6_3->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMSAUF) && (0UL != (VSSEL134 & BIT_MASK_03))) {
            TMR6_3_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.3 specified down compare match A*/
    if (1UL == bCM_TMR6_3->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMSADF) && (0UL != (VSSEL134 & BIT_MASK_03))) {
            TMR6_3_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.3 specified up compare match B*/
    if (1UL == bCM_TMR6_3->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMSBUF) && (0UL != (VSSEL134 & BIT_MASK_04))) {
            TMR6_3_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.3 specified down compare match B*/
    if (1UL == bCM_TMR6_3->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_3->STFLR_b.CMSBDF) && (0UL != (VSSEL134 & BIT_MASK_04))) {
            TMR6_3_SCmpDownB_IrqHandler();
        }
    }
    /* Timer4 Unit.3 U phase reload */
    if (0UL == bCM_TMR4_3->RCSR_b.RTIDU) {
        if ((1UL == bCM_TMR4_3->RCSR_b.RTIFU) && (0UL != (VSSEL134 & BIT_MASK_05))) {
            TMR4_3_ReloadU_IrqHandler();
        }
    }
    /* Timer4 Unit.3 V phase reload */
    if (0UL == bCM_TMR4_3->RCSR_b.RTIDV) {
        if ((1UL == bCM_TMR4_3->RCSR_b.RTIFV) && (0UL != (VSSEL134 & BIT_MASK_06))) {
            TMR4_3_ReloadV_IrqHandler();
        }
    }
    /* Timer4 Unit.3 W phase reload */
    if (0UL == bCM_TMR4_3->RCSR_b.RTIDW) {
        if ((1UL == bCM_TMR4_3->RCSR_b.RTIFW) && (0UL != (VSSEL134 & BIT_MASK_07))) {
            TMR4_3_ReloadW_IrqHandler();
        }
    }

    /* USART Ch.3 Rx timeout */
    if (1UL == bCM_USART3->CR1_b.RTOIE) {
        if ((1UL == bCM_USART3->SR_b.RTOF) && (0UL != (VSSEL134 & BIT_MASK_08))) {
            USART3_RxTO_IrqHandler();
        }
    }
    /* USART Ch.4 Rx timeout */
    if (1UL == bCM_USART4->CR1_b.RTOIE) {
        if ((1UL == bCM_USART4->SR_b.RTOF) && (0UL != (VSSEL134 & BIT_MASK_09))) {
            USART4_RxTO_IrqHandler();
        }
    }
    /* USART Ch.5 Rx timeout */
    if (1UL == bCM_USART5->CR1_b.RTOIE) {
        if ((1UL == bCM_USART5->SR_b.RTOF) && (0UL != (VSSEL134 & BIT_MASK_10))) {
            USART5_RxTO_IrqHandler();
        }
    }
    /* USART Ch.8 Rx timeout */
    if (1UL == bCM_USART8->CR1_b.RTOIE) {
        if ((1UL == bCM_USART8->SR_b.RTOF) && (0UL != (VSSEL134 & BIT_MASK_11))) {
            USART8_RxTO_IrqHandler();
        }
    }
    /* USART Ch.9 Rx timeout */
    if (1UL == bCM_USART9->CR1_b.RTOIE) {
        if ((1UL == bCM_USART9->SR_b.RTOF) && (0UL != (VSSEL134 & BIT_MASK_12))) {
            USART9_RxTO_IrqHandler();
        }
    }
    /* USART Ch.10 Rx timeout */
    if (1UL == bCM_USART10->CR1_b.RTOIE) {
        if ((1UL == bCM_USART10->SR_b.RTOF) && (0UL != (VSSEL134 & BIT_MASK_13))) {
            USART10_RxTO_IrqHandler();
        }
    }
    /* PKE RAM ECC error */
    u32Tmp1 = CM_PKE->RAM0_CKCR & PKE_RAM0_CKCR_ECCMOD;
    u32Tmp2 = CM_PKE->RAM1_CKCR & PKE_RAM1_CKCR_ECCMOD;
    if (0UL != (VSSEL134 & BIT_MASK_15)) {
        if (((1UL == bCM_PKE->RAM0_CKSR_b.RAM_1ERR) && (u32Tmp1 == 0x3UL)) || \
            ((1UL == bCM_PKE->RAM0_CKSR_b.RAM_2ERR) && (u32Tmp1 != 0UL))) {
            PKE_Ram0EccError_IrqHandler();
        }
        if (((1UL == bCM_PKE->RAM1_CKSR_b.RAM_1ERR) && (u32Tmp2 == 0x3UL)) || \
            ((1UL == bCM_PKE->RAM1_CKSR_b.RAM_2ERR) && (u32Tmp2 != 0UL))) {
            PKE_Ram1EccError_IrqHandler();
        }
    }
    /* Timer6 Unit.4 general compare match A */
    if (1UL == bCM_TMR6_4->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMAF) && (0UL != (VSSEL134 & BIT_MASK_16))) {
            TMR6_4_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.4 general compare match B */
    if (1UL == bCM_TMR6_4->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMBF) && (0UL != (VSSEL134 & BIT_MASK_17))) {
            TMR6_4_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.4 general compare match C */
    if (1UL == bCM_TMR6_4->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMCF) && (0UL != (VSSEL134 & BIT_MASK_18))) {
            TMR6_4_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.4 general compare match D */
    if (1UL == bCM_TMR6_4->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMDF) && (0UL != (VSSEL134 & BIT_MASK_19))) {
            TMR6_4_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.4 general compare match E */
    if (1UL == bCM_TMR6_4->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMEF) && (0UL != (VSSEL134 & BIT_MASK_20))) {
            TMR6_4_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.4 general compare match F */
    if (1UL == bCM_TMR6_4->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMFF) && (0UL != (VSSEL134 & BIT_MASK_21))) {
            TMR6_4_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.4 overflow*/
    if (1UL == bCM_TMR6_4->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_4->STFLR_b.OVFF) && (0UL != (VSSEL134 & BIT_MASK_22))) {
            TMR6_4_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.4 underflow*/
    if (1UL == bCM_TMR6_4->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_4->STFLR_b.UDFF) && (0UL != (VSSEL134 & BIT_MASK_23))) {
            TMR6_4_GUdf_IrqHandler();
        }
    }
    /* Timer6 Unit.4 dead time */
    if (1UL == bCM_TMR6_4->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_4->STFLR_b.DTEF) && (0UL != (VSSEL134 & BIT_MASK_24))) {
            TMR6_4_Gdte_IrqHandler();
        }
    }
    /* Timer6 Unit.4 specified up compare match A*/
    if (1UL == bCM_TMR6_4->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMSAUF) && (0UL != (VSSEL134 & BIT_MASK_27))) {
            TMR6_4_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.4 specified down compare match A*/
    if (1UL == bCM_TMR6_4->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMSADF) && (0UL != (VSSEL134 & BIT_MASK_27))) {
            TMR6_4_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.4 specified up compare match B*/
    if (1UL == bCM_TMR6_4->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMSBUF) && (0UL != (VSSEL134 & BIT_MASK_28))) {
            TMR6_4_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.4 specified down compare match B*/
    if (1UL == bCM_TMR6_4->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_4->STFLR_b.CMSBDF) && (0UL != (VSSEL134 & BIT_MASK_28))) {
            TMR6_4_SCmpDownB_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.135 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ135_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    const uint32_t VSSEL135 = CM_INTC->VSSEL135;

