levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32f4a8_ll_interrupts_share.c
    /* Timer6 Unit.5 general compare match A */
    if (1UL == bCM_TMR6_5->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMAF) && (0UL != (VSSEL135 & BIT_MASK_00))) {
            TMR6_5_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.5 general compare match B */
    if (1UL == bCM_TMR6_5->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMBF) && (0UL != (VSSEL135 & BIT_MASK_01))) {
            TMR6_5_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.5 general compare match C */
    if (1UL == bCM_TMR6_5->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMCF) && (0UL != (VSSEL135 & BIT_MASK_02))) {
            TMR6_5_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.5 general compare match D */
    if (1UL == bCM_TMR6_5->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMDF) && (0UL != (VSSEL135 & BIT_MASK_03))) {
            TMR6_5_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.5 general compare match E */
    if (1UL == bCM_TMR6_5->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMEF) && (0UL != (VSSEL135 & BIT_MASK_04))) {
            TMR6_5_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.5 general compare match F */
    if (1UL == bCM_TMR6_5->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMFF) && (0UL != (VSSEL135 & BIT_MASK_05))) {
            TMR6_5_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.5 overflow*/
    if (1UL == bCM_TMR6_5->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_5->STFLR_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_06))) {
            TMR6_5_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.5 underflow*/
    if (1UL == bCM_TMR6_5->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_5->STFLR_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_07))) {
            TMR6_5_GUdf_IrqHandler();
        }
    }
    /* Timer6 Unit.5 dead time */
    if (1UL == bCM_TMR6_5->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_5->STFLR_b.DTEF) && (0UL != (VSSEL135 & BIT_MASK_08))) {
            TMR6_5_Gdte_IrqHandler();
        }
    }
    /* Timer6 Unit.5 specified up compare match A*/
    if (1UL == bCM_TMR6_5->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMSAUF) && (0UL != (VSSEL135 & BIT_MASK_11))) {
            TMR6_5_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.5 specified down compare match A*/
    if (1UL == bCM_TMR6_5->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMSADF) && (0UL != (VSSEL135 & BIT_MASK_11))) {
            TMR6_5_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.5 specified up compare match B*/
    if (1UL == bCM_TMR6_5->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMSBUF) && (0UL != (VSSEL135 & BIT_MASK_12))) {
            TMR6_5_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.5 specified down compare match B*/
    if (1UL == bCM_TMR6_5->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_5->STFLR_b.CMSBDF) && (0UL != (VSSEL135 & BIT_MASK_12))) {
            TMR6_5_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Unit.1 overflow */
    if (1UL == bCM_TMRA_1->BCSTRH_b.ITENOVF) {
        if ((1UL == bCM_TMRA_1->BCSTRH_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_13))) {
            TMRA_1_Ovf_IrqHandler();
        }
    }
    /* TimerA Unit.1 underflow */
    if (1UL == bCM_TMRA_1->BCSTRH_b.ITENUDF) {
        if ((1UL == bCM_TMRA_1->BCSTRH_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_14))) {
            TMRA_1_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_1->ICONR;
    u32Tmp2 = CM_TMRA_1->STFLR;
    /* TimerA Unit.1 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL135 & BIT_MASK_15))) {
        TMRA_1_Cmp_IrqHandler();
    }
    /* Timer6 Unit.6 general compare match A */
    if (1UL == bCM_TMR6_6->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMAF) && (0UL != (VSSEL135 & BIT_MASK_16))) {
            TMR6_6_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.6 general compare match B */
    if (1UL == bCM_TMR6_6->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMBF) && (0UL != (VSSEL135 & BIT_MASK_17))) {
            TMR6_6_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.6 general compare match C */
    if (1UL == bCM_TMR6_6->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMCF) && (0UL != (VSSEL135 & BIT_MASK_18))) {
            TMR6_6_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.6 general compare match D */
    if (1UL == bCM_TMR6_6->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMDF) && (0UL != (VSSEL135 & BIT_MASK_19))) {
            TMR6_6_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.6 general compare match E */
    if (1UL == bCM_TMR6_6->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMEF) && (0UL != (VSSEL135 & BIT_MASK_20))) {
            TMR6_6_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.6 general compare match F */
    if (1UL == bCM_TMR6_6->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMFF) && (0UL != (VSSEL135 & BIT_MASK_21))) {
            TMR6_6_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.6 overflow*/
    if (1UL == bCM_TMR6_6->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_6->STFLR_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_22))) {
            TMR6_6_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.6 underflow*/
    if (1UL == bCM_TMR6_6->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_6->STFLR_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_23))) {
            TMR6_6_GUdf_IrqHandler();
        }
    }
    /* Timer6 Unit.6 dead time */
    if (1UL == bCM_TMR6_6->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_6->STFLR_b.DTEF) && (0UL != (VSSEL135 & BIT_MASK_24))) {
            TMR6_6_Gdte_IrqHandler();
        }
    }
    /* Timer6 Unit.6 specified up compare match A*/
    if (1UL == bCM_TMR6_6->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMSAUF) && (0UL != (VSSEL135 & BIT_MASK_27))) {
            TMR6_6_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.6 specified down compare match A*/
    if (1UL == bCM_TMR6_6->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMSADF) && (0UL != (VSSEL135 & BIT_MASK_27))) {
            TMR6_6_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.6 specified up compare match B*/
    if (1UL == bCM_TMR6_6->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMSBUF) && (0UL != (VSSEL135 & BIT_MASK_28))) {
            TMR6_6_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.6 specified down compare match B*/
    if (1UL == bCM_TMR6_6->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_6->STFLR_b.CMSBDF) && (0UL != (VSSEL135 & BIT_MASK_28))) {
            TMR6_6_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Unit.2 overflow */
    if (1UL == bCM_TMRA_2->BCSTRH_b.ITENOVF) {
        if ((1UL == bCM_TMRA_2->BCSTRH_b.OVFF) && (0UL != (VSSEL135 & BIT_MASK_29))) {
            TMRA_2_Ovf_IrqHandler();
        }
    }
    /* TimerA Unit.2 underflow */
    if (1UL == bCM_TMRA_2->BCSTRH_b.ITENUDF) {
        if ((1UL == bCM_TMRA_2->BCSTRH_b.UDFF) && (0UL != (VSSEL135 & BIT_MASK_30))) {
            TMRA_2_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_2->ICONR;
    u32Tmp2 = CM_TMRA_2->STFLR;
    /* TimerA Unit.2 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL135 & BIT_MASK_31))) {
        TMRA_2_Cmp_IrqHandler();
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.136 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ136_Handler(void)
{
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;
    const uint32_t VSSEL136 = CM_INTC->VSSEL136;

    /* Timer6 Unit.7 general compare match A */
    if (1UL == bCM_TMR6_7->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMAF) && (0UL != (VSSEL136 & BIT_MASK_00))) {
            TMR6_7_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.7 general compare match B */
    if (1UL == bCM_TMR6_7->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMBF) && (0UL != (VSSEL136 & BIT_MASK_01))) {
            TMR6_7_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.7 general compare match C */
    if (1UL == bCM_TMR6_7->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMCF) && (0UL != (VSSEL136 & BIT_MASK_02))) {
            TMR6_7_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.7 general compare match D */
    if (1UL == bCM_TMR6_7->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMDF) && (0UL != (VSSEL136 & BIT_MASK_03))) {
            TMR6_7_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.7 general compare match E */
    if (1UL == bCM_TMR6_7->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMEF) && (0UL != (VSSEL136 & BIT_MASK_04))) {
            TMR6_7_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.7 general compare match F */
    if (1UL == bCM_TMR6_7->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMFF) && (0UL != (VSSEL136 & BIT_MASK_05))) {
            TMR6_7_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.7 overflow*/
    if (1UL == bCM_TMR6_7->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_7->STFLR_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_06))) {
            TMR6_7_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.7 underflow*/
    if (1UL == bCM_TMR6_7->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_7->STFLR_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_07))) {
            TMR6_7_GUdf_IrqHandler();
        }
    }
    /* Timer6 Unit.7 dead time */
    if (1UL == bCM_TMR6_7->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_7->STFLR_b.DTEF) && (0UL != (VSSEL136 & BIT_MASK_08))) {
            TMR6_7_Gdte_IrqHandler();
        }
    }
    /* Timer6 Unit.7 specified up compare match A*/
    if (1UL == bCM_TMR6_7->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMSAUF) && (0UL != (VSSEL136 & BIT_MASK_11))) {
            TMR6_7_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.7 specified down compare match A*/
    if (1UL == bCM_TMR6_7->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMSADF) && (0UL != (VSSEL136 & BIT_MASK_11))) {
            TMR6_7_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.7 specified up compare match B*/
    if (1UL == bCM_TMR6_7->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMSBUF) && (0UL != (VSSEL136 & BIT_MASK_12))) {
            TMR6_7_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.7 specified down compare match B*/
    if (1UL == bCM_TMR6_7->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_7->STFLR_b.CMSBDF) && (0UL != (VSSEL136 & BIT_MASK_12))) {
            TMR6_7_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Unit.3 overflow */
    if (1UL == bCM_TMRA_3->BCSTRH_b.ITENOVF) {
        if ((1UL == bCM_TMRA_3->BCSTRH_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_13))) {
            TMRA_3_Ovf_IrqHandler();
        }
    }
    /* TimerA Unit.3 underflow */
    if (1UL == bCM_TMRA_3->BCSTRH_b.ITENUDF) {
        if ((1UL == bCM_TMRA_3->BCSTRH_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_14))) {
            TMRA_3_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_3->ICONR;
    u32Tmp2 = CM_TMRA_3->STFLR;
    /* TimerA Unit.3 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL136 & BIT_MASK_15))) {
        TMRA_3_Cmp_IrqHandler();
    }
    /* Timer6 Unit.8 general compare match A */
    if (1UL == bCM_TMR6_8->ICONR_b.INTENA) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMAF) && (0UL != (VSSEL136 & BIT_MASK_16))) {
            TMR6_8_GCmpA_IrqHandler();
        }
    }
    /* Timer6 Unit.8 general compare match B */
    if (1UL == bCM_TMR6_8->ICONR_b.INTENB) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMBF) && (0UL != (VSSEL136 & BIT_MASK_17))) {
            TMR6_8_GCmpB_IrqHandler();
        }
    }
    /* Timer6 Unit.8 general compare match C */
    if (1UL == bCM_TMR6_8->ICONR_b.INTENC) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMCF) && (0UL != (VSSEL136 & BIT_MASK_18))) {
            TMR6_8_GCmpC_IrqHandler();
        }
    }
    /* Timer6 Unit.8 general compare match D */
    if (1UL == bCM_TMR6_8->ICONR_b.INTEND) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMDF) && (0UL != (VSSEL136 & BIT_MASK_19))) {
            TMR6_8_GCmpD_IrqHandler();
        }
    }
    /* Timer6 Unit.8 general compare match E */
    if (1UL == bCM_TMR6_8->ICONR_b.INTENE) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMEF) && (0UL != (VSSEL136 & BIT_MASK_20))) {
            TMR6_8_GCmpE_IrqHandler();
        }
    }
    /* Timer6 Unit.8 general compare match F */
    if (1UL == bCM_TMR6_8->ICONR_b.INTENF) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMFF) && (0UL != (VSSEL136 & BIT_MASK_21))) {
            TMR6_8_GCmpF_IrqHandler();
        }
    }
    /* Timer6 Unit.8 overflow*/
    if (1UL == bCM_TMR6_8->ICONR_b.INTENOVF) {
        if ((1UL == bCM_TMR6_8->STFLR_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_22))) {
            TMR6_8_GOvf_IrqHandler();
        }
    }
    /* Timer6 Unit.8 underflow*/
    if (1UL == bCM_TMR6_8->ICONR_b.INTENUDF) {
        if ((1UL == bCM_TMR6_8->STFLR_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_23))) {
            TMR6_8_GUdf_IrqHandler();
        }
    }
    /* Timer6 Unit.8 dead time */
    if (1UL == bCM_TMR6_8->ICONR_b.INTENDTE) {
        if ((1UL == bCM_TMR6_8->STFLR_b.DTEF) && (0UL != (VSSEL136 & BIT_MASK_24))) {
            TMR6_8_Gdte_IrqHandler();
        }
    }
    /* Timer6 Unit.8 specified up compare match A*/
    if (1UL == bCM_TMR6_8->ICONR_b.INTENSAU) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMSAUF) && (0UL != (VSSEL136 & BIT_MASK_27))) {
            TMR6_8_SCmpUpA_IrqHandler();
        }
    }
    /* Timer6 Unit.8 specified down compare match A*/
    if (1UL == bCM_TMR6_8->ICONR_b.INTENSAD) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMSADF) && (0UL != (VSSEL136 & BIT_MASK_27))) {
            TMR6_8_SCmpDownA_IrqHandler();
        }
    }
    /* Timer6 Unit.8 specified up compare match B*/
    if (1UL == bCM_TMR6_8->ICONR_b.INTENSBU) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMSBUF) && (0UL != (VSSEL136 & BIT_MASK_28))) {
            TMR6_8_SCmpUpB_IrqHandler();
        }
    }
    /* Timer6 Unit.8 specified down compare match B*/
    if (1UL == bCM_TMR6_8->ICONR_b.INTENSBD) {
        if ((1UL == bCM_TMR6_8->STFLR_b.CMSBDF) && (0UL != (VSSEL136 & BIT_MASK_28))) {
            TMR6_8_SCmpDownB_IrqHandler();
        }
    }
    /* TimerA Unit.4 overflow */
    if (1UL == bCM_TMRA_4->BCSTRH_b.ITENOVF) {
        if ((1UL == bCM_TMRA_4->BCSTRH_b.OVFF) && (0UL != (VSSEL136 & BIT_MASK_29))) {
            TMRA_4_Ovf_IrqHandler();
        }
    }
    /* TimerA Unit.4 underflow */
    if (1UL == bCM_TMRA_4->BCSTRH_b.ITENUDF) {
        if ((1UL == bCM_TMRA_4->BCSTRH_b.UDFF) && (0UL != (VSSEL136 & BIT_MASK_30))) {
            TMRA_4_Udf_IrqHandler();
        }
    }
    u32Tmp1 = CM_TMRA_4->ICONR;
    u32Tmp2 = CM_TMRA_4->STFLR;
    /* TimerA Unit.4 compare match */
    if ((0UL != (u32Tmp1 & u32Tmp2 & 0x0FUL)) && (0UL != (VSSEL136 & BIT_MASK_31))) {
        TMRA_4_Cmp_IrqHandler();
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.137 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ137_Handler(void)
{
    const uint32_t VSSEL137 = CM_INTC->VSSEL137;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* EMB0 */
    u32Tmp1 = CM_EMB0->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB0->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_00))) {
        EMB_GR0_IrqHandler();
    }
    /* EMB1 */
    u32Tmp1 = CM_EMB1->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB1->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_01))) {
        EMB_GR1_IrqHandler();
    }
    /* EMB2 */
    u32Tmp1 = CM_EMB2->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB2->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_02))) {
        EMB_GR2_IrqHandler();
    }
    /* EMB3 */
    u32Tmp1 = CM_EMB3->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB3->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_03))) {
        EMB_GR3_IrqHandler();
    }
    /* EMB4 */
    u32Tmp1 = CM_EMB4->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB4->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_04))) {
        EMB_GR4_IrqHandler();
    }
    /* EMB5 */
    u32Tmp1 = CM_EMB5->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB5->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_05))) {
        EMB_GR5_IrqHandler();
    }
    /* EMB6 */
    u32Tmp1 = CM_EMB6->INTEN & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                                BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    u32Tmp2 = CM_EMB6->STAT & (BIT_MASK_01 | BIT_MASK_02 | BIT_MASK_03 |   \
                               BIT_MASK_08 | BIT_MASK_09 | BIT_MASK_10 | BIT_MASK_11);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_06))) {
        EMB_GR6_IrqHandler();
    }
    /* USB HS interrupts */
    if (1UL == bCM_USBHS->GAHBCFG_b.GINTMSK) {
        /* USB HS EP1 out interrupt */
        u32Tmp1 = bCM_USBHS->DEACHINT_b.OEP1INT;
        u32Tmp2 = bCM_USBHS->DEACHINTMSK_b.OEP1INTM;
        if ((0UL != u32Tmp1) && (0UL != u32Tmp2) && (0UL != (VSSEL137 & BIT_MASK_07))) {
            USBHS_EP1Out_IrqHandler();
        }
        /* USB HS EP1 in interrupt */
        u32Tmp1 = bCM_USBHS->DEACHINT_b.IEP1INT;
        u32Tmp2 = bCM_USBHS->DEACHINTMSK_b.IEP1INTM;
        if ((0UL != u32Tmp1) && (0UL != u32Tmp2) && (0UL != (VSSEL137 & BIT_MASK_08))) {
            USBHS_EP1In_IrqHandler();
        }
        /* USB HS global interrupt */
        u32Tmp1 = CM_USBHS->GINTMSK & 0xFF7CFCFBUL;
        u32Tmp2 = CM_USBHS->GINTSTS & 0xFF7CFCFBUL;
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL137 & BIT_MASK_09))) {
            USBHS_Global_IrqHandler();
        }
        /* USB HS wakeup interrupt */
        u32Tmp1 = bCM_USBHS->GINTSTS_b.WKUINT;
        u32Tmp2 = bCM_USBHS->GINTMSK_b.WKUIM;
        if ((0UL != u32Tmp1) && (0UL != u32Tmp2) && (0UL != (VSSEL137 & BIT_MASK_10))) {
            USBHS_Wakeup_IrqHandler();
        }
    }
    if (1UL == bCM_USART1->CR1_b.RIE) {
        /* USART Ch.1 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART1->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_12))) {
            USART1_RxError_IrqHandler();
        }
        /* USART Ch.1 Rx end */
        if ((1UL == bCM_USART1->SR_b.RXNE) && (0UL != (VSSEL137 & BIT_MASK_13))) {
            USART1_RxFull_IrqHandler();
        }
    }
    /* USART Ch.1 Tx buffer empty */
    if (1UL == bCM_USART1->CR1_b.TXEIE) {
        if ((1UL == bCM_USART1->SR_b.TXE) && (0UL != (VSSEL137 & BIT_MASK_14))) {
            USART1_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.1 Tx end */
    if (1UL == bCM_USART1->CR1_b.TCIE) {
        if ((1UL == bCM_USART1->SR_b.TC) && (0UL != (VSSEL137 & BIT_MASK_15))) {
            USART1_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.1 Rx timeout */
    if (1UL == bCM_USART1->CR1_b.RTOIE) {
        if ((1UL == bCM_USART1->SR_b.RTOF) && (0UL != (VSSEL137 & BIT_MASK_16))) {
            USART1_RxTO_IrqHandler();
        }
    }
    if (1UL == bCM_USART2->CR1_b.RIE) {
        /* USART Ch.2 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART2->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_17))) {
            USART2_RxError_IrqHandler();
        }
        /* USART Ch.2 Rx end */
        if ((1UL == bCM_USART2->SR_b.RXNE) && (0UL != (VSSEL137 & BIT_MASK_18))) {
            USART2_RxFull_IrqHandler();
        }
    }
    /* USART Ch.2 Tx buffer empty */
    if (1UL == bCM_USART2->CR1_b.TXEIE) {
        if ((1UL == bCM_USART2->SR_b.TXE) && (0UL != (VSSEL137 & BIT_MASK_19))) {
            USART2_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.2 Tx end */
    if (1UL == bCM_USART2->CR1_b.TCIE) {
        if ((1UL == bCM_USART2->SR_b.TC) && (0UL != (VSSEL137 & BIT_MASK_20))) {
            USART2_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.2 Rx timeout */
    if (1UL == bCM_USART2->CR1_b.RTOIE) {
        if ((1UL == bCM_USART2->SR_b.RTOF) && (0UL != (VSSEL137 & BIT_MASK_21))) {
            USART2_RxTO_IrqHandler();
        }
    }
    /* SPI Ch.1 Rx end */
    if (1UL == bCM_SPI1->CR_b.RXIE) {
        if ((1UL == bCM_SPI1->SR_b.RDFF) && (0UL != (VSSEL137 & BIT_MASK_22))) {
            SPI1_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.1 Tx buffer empty */
    if (1UL == bCM_SPI1->CR_b.TXIE) {
        if ((1UL == bCM_SPI1->SR_b.TDEF) && (0UL != (VSSEL137 & BIT_MASK_23))) {
            SPI1_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.1 Bus idle */
    if (1UL == bCM_SPI1->CR_b.IDIE) {
        if ((0UL == bCM_SPI1->SR_b.IDLNF) && (0UL != (VSSEL137 & BIT_MASK_24))) {
            SPI1_Idle_IrqHandler();
        }
    }
    /* SPI Ch.1 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI1->CR_b.EIE) {
        u32Tmp1 = CM_SPI1->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_25))) {
            SPI1_Error_IrqHandler();
        }
    }
    /* SPI Ch.2 Rx end */
    if (1UL == bCM_SPI2->CR_b.RXIE) {
        if ((1UL == bCM_SPI2->SR_b.RDFF) && (0UL != (VSSEL137 & BIT_MASK_27))) {
            SPI2_RxFull_IrqHandler();
        }
    }
    /* SPI Ch.2 Tx buffer empty */
    if (1UL == bCM_SPI2->CR_b.TXIE) {
        if ((1UL == bCM_SPI2->SR_b.TDEF) && (0UL != (VSSEL137 & BIT_MASK_28))) {
            SPI2_TxEmpty_IrqHandler();
        }
    }
    /* SPI Ch.2 Bus idle */
    if (1UL == bCM_SPI2->CR_b.IDIE) {
        if ((0UL == bCM_SPI2->SR_b.IDLNF) && (0UL != (VSSEL137 & BIT_MASK_29))) {
            SPI2_Idle_IrqHandler();
        }
    }
    /* SPI Ch.2 parity/overflow/underflow/mode error */
    if (1UL == bCM_SPI2->CR_b.EIE) {
        u32Tmp1 = CM_SPI2->SR & (SPI_SR_OVRERF | SPI_SR_MODFERF | SPI_SR_PERF | SPI_SR_UDRERF);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL137 & BIT_MASK_30))) {
            SPI2_Error_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

