levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32f4a8_ll_interrupts_share.c
    /* I2S Ch.1 Tx */
    if (1UL == bCM_I2S1->CTRL_b.TXIE) {
        if ((1UL == bCM_I2S1->SR_b.TXBA) && (0UL != (VSSEL140 & BIT_MASK_00))) {
            I2S1_Tx_IrqHandler();
        }
    }
    /* I2S Ch.1 Rx */
    if (1UL == bCM_I2S1->CTRL_b.RXIE) {
        if ((1UL == bCM_I2S1->SR_b.RXBA) && (0UL != (VSSEL140 & BIT_MASK_01))) {
            I2S1_Rx_IrqHandler();
        }
    }
    /* I2S Ch.1 Error */
    if (1UL == bCM_I2S1->CTRL_b.EIE) {
        u32Tmp1 = CM_I2S1->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_02))) {
            I2S1_Error_IrqHandler();
        }
    }
    /* I2S Ch.2 Tx */
    if (1UL == bCM_I2S2->CTRL_b.TXIE) {
        if ((1UL == bCM_I2S2->SR_b.TXBA) && (0UL != (VSSEL140 & BIT_MASK_03))) {
            I2S2_Tx_IrqHandler();
        }
    }
    /* I2S Ch.2 Rx */
    if (1UL == bCM_I2S2->CTRL_b.RXIE) {
        if ((1UL == bCM_I2S2->SR_b.RXBA) && (0UL != (VSSEL140 & BIT_MASK_04))) {
            I2S2_Rx_IrqHandler();
        }
    }
    /* I2S Ch.2 Error */
    if (1UL == bCM_I2S2->CTRL_b.EIE) {
        u32Tmp1 = CM_I2S2->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_05))) {
            I2S2_Error_IrqHandler();
        }
    }
    if (1UL == bCM_USART7->CR1_b.RIE) {
        /* USART Ch.7 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART7->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_06))) {
            USART7_RxError_IrqHandler();
        }
        /* USART Ch.7 Rx end */
        if ((1UL == bCM_USART7->SR_b.RXNE) && (0UL != (VSSEL140 & BIT_MASK_07))) {
            USART7_RxFull_IrqHandler();
        }
    }
    /* USART Ch.7 Tx buffer empty */
    if (1UL == bCM_USART7->CR1_b.TXEIE) {
        if ((1UL == bCM_USART7->SR_b.TXE) && (0UL != (VSSEL140 & BIT_MASK_08))) {
            USART7_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.7 Tx end */
    if (1UL == bCM_USART7->CR1_b.TCIE) {
        if ((1UL == bCM_USART7->SR_b.TC) && (0UL != (VSSEL140 & BIT_MASK_09))) {
            USART7_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.7 Rx timeout */
    if (1UL == bCM_USART7->CR1_b.RTOIE) {
        if ((1UL == bCM_USART7->SR_b.RTOF) && (0UL != (VSSEL140 & BIT_MASK_10))) {
            USART7_RxTO_IrqHandler();
        }
    }
    if (1UL == bCM_USART8->CR1_b.RIE) {
        /* USART Ch.8 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART8->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL140 & BIT_MASK_11))) {
            USART8_RxError_IrqHandler();
        }
        /* USART Ch.8 Rx end */
        if ((1UL == bCM_USART8->SR_b.RXNE) && (0UL != (VSSEL140 & BIT_MASK_12))) {
            USART8_RxFull_IrqHandler();
        }
    }
    /* USART Ch.8 Tx buffer empty */
    if (1UL == bCM_USART8->CR1_b.TXEIE) {
        if ((1UL == bCM_USART8->SR_b.TXE) && (0UL != (VSSEL140 & BIT_MASK_13))) {
            USART8_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.8 Tx end */
    if (1UL == bCM_USART8->CR1_b.TCIE) {
        if ((1UL == bCM_USART8->SR_b.TC) && (0UL != (VSSEL140 & BIT_MASK_14))) {
            USART8_TxComplete_IrqHandler();
        }
    }
    /* USB FS interrupts */
    if (1UL == bCM_USBFS->GAHBCFG_b.GINTMSK) {
        /* USB FS global interrupt */
        u32Tmp1 = CM_USBFS->GINTMSK & 0xFF7CFCFBUL;
        u32Tmp2 = CM_USBFS->GINTSTS & 0xFF7CFCFBUL;
        if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL140 & BIT_MASK_15))) {
            USBFS_Global_IrqHandler();
        }
        /* USB FS wakeup interrupt */
        u32Tmp1 = bCM_USBFS->GINTSTS_b.WKUINT;
        u32Tmp2 = bCM_USBFS->GINTMSK_b.WKUIM;
        if ((0UL != u32Tmp1) && (0UL != u32Tmp2) && (0UL != (VSSEL140 & BIT_MASK_16))) {
            USBFS_Wakeup_IrqHandler();
        }
    }
    /* SDIO unit 1 */
    if (0UL != (VSSEL140 & BIT_MASK_20)) {
        NORINTST = CM_SDIOC1->NORINTST & (SDIOC_NORINTST_CINT | SDIOC_NORINTST_CRM | SDIOC_NORINTST_CIST |  \
                                          SDIOC_NORINTST_BRR  | SDIOC_NORINTST_BWR | SDIOC_NORINTST_BGE  |  \
                                          SDIOC_NORINTST_TC   | SDIOC_NORINTST_CC);
        NORINTSGEN = CM_SDIOC1->NORINTSGEN & (SDIOC_NORINTSTEN_CINTEN | SDIOC_NORINTSTEN_CRMEN |    \
                                              SDIOC_NORINTSTEN_CISTEN | SDIOC_NORINTSTEN_BRREN |    \
                                              SDIOC_NORINTSTEN_BWREN  | SDIOC_NORINTSTEN_BGEEN |    \
                                              SDIOC_NORINTSTEN_TCEN   | SDIOC_NORINTSTEN_CCEN);
        ERRINTSGEN = CM_SDIOC1->ERRINTSGEN & (SDIOC_ERRINTSTEN_ACEEN | SDIOC_ERRINTSTEN_DEBEEN |    \
                                              SDIOC_ERRINTSTEN_DCEEN | SDIOC_ERRINTSTEN_DTOEEN |    \
                                              SDIOC_ERRINTSTEN_CIEEN | SDIOC_ERRINTSTEN_CEBEEN |    \
                                              SDIOC_ERRINTSTEN_CCEEN | SDIOC_ERRINTSTEN_CTOEEN);
        if (0U != (NORINTST & NORINTSGEN)) {
            SDIOC1_Normal_IrqHandler();
        }
        if ((1UL == bCM_SDIOC1->NORINTST_b.EI) && (0U != ERRINTSGEN)) {
            SDIOC1_Error_IrqHandler();
        }
    }
    /* SDIO unit 2 */
    if (0UL != (VSSEL140 & BIT_MASK_23)) {
        NORINTST = CM_SDIOC2->NORINTST & (SDIOC_NORINTST_CINT | SDIOC_NORINTST_CRM | SDIOC_NORINTST_CIST |  \
                                          SDIOC_NORINTST_BRR  | SDIOC_NORINTST_BWR | SDIOC_NORINTST_BGE  |  \
                                          SDIOC_NORINTST_TC   | SDIOC_NORINTST_CC);
        NORINTSGEN = CM_SDIOC2->NORINTSGEN & (SDIOC_NORINTSTEN_CINTEN | SDIOC_NORINTSTEN_CRMEN |    \
                                              SDIOC_NORINTSTEN_CISTEN | SDIOC_NORINTSTEN_BRREN |    \
                                              SDIOC_NORINTSTEN_BWREN  | SDIOC_NORINTSTEN_BGEEN |    \
                                              SDIOC_NORINTSTEN_TCEN   | SDIOC_NORINTSTEN_CCEN);
        ERRINTSGEN = CM_SDIOC2->ERRINTSGEN & (SDIOC_ERRINTSTEN_ACEEN | SDIOC_ERRINTSTEN_DEBEEN |    \
                                              SDIOC_ERRINTSTEN_DCEEN | SDIOC_ERRINTSTEN_DTOEEN |    \
                                              SDIOC_ERRINTSTEN_CIEEN | SDIOC_ERRINTSTEN_CEBEEN |    \
                                              SDIOC_ERRINTSTEN_CCEEN | SDIOC_ERRINTSTEN_CTOEEN);
        if (0U != (NORINTST & NORINTSGEN)) {
            SDIOC2_Normal_IrqHandler();
        }
        if ((1UL == bCM_SDIOC2->NORINTST_b.EI) && (0U != ERRINTSGEN)) {
            SDIOC2_Error_IrqHandler();
        }
    }
    /* Ethernet global */
    MMC_REVSTSR = CM_ETH->MMC_REVSTSR & (ETH_MMC_REVSTSR_RXOEIS | ETH_MMC_REVSTSR_RXLEIS |  \
                                         ETH_MMC_REVSTSR_RXUGIS | ETH_MMC_REVSTSR_RXREIS |  \
                                         ETH_MMC_REVSTSR_RXAEIS | ETH_MMC_REVSTSR_RXCEIS |  \
                                         ETH_MMC_REVSTSR_RXMGIS | ETH_MMC_REVSTSR_RXBGIS);
    MMC_TRSSTSR = CM_ETH->MMC_TRSSTSR & (ETH_MMC_TRSSTSR_TXEDEIS | ETH_MMC_TRSSTSR_TXUGIS |  \
                                         ETH_MMC_TRSSTSR_TXCAEIS | ETH_MMC_TRSSTSR_TXECEIS |  \
                                         ETH_MMC_TRSSTSR_TXLCEIS | ETH_MMC_TRSSTSR_TXDEEIS |  \
                                         ETH_MMC_TRSSTSR_TXMGIS | ETH_MMC_TRSSTSR_TXBGIS);
    MMC_RITCTLR = CM_ETH->MMC_RITCTLR & (ETH_MMC_RITCTLR_RXBGIM | ETH_MMC_RITCTLR_RXMGIM |  \
                                         ETH_MMC_RITCTLR_RXCEIM | ETH_MMC_RITCTLR_RXAEIM |  \
                                         ETH_MMC_RITCTLR_RXREIM | ETH_MMC_RITCTLR_RXUGIM |  \
                                         ETH_MMC_RITCTLR_RXLEIM | ETH_MMC_RITCTLR_RXOEIM);
    MMC_TITCTLR = CM_ETH->MMC_TITCTLR & (ETH_MMC_TITCTLR_TXBGIM | ETH_MMC_TITCTLR_TXMGIM |  \
                                         ETH_MMC_TITCTLR_TXDEEIM | ETH_MMC_TITCTLR_TXLCEIM |  \
                                         ETH_MMC_TITCTLR_TXECEIM | ETH_MMC_TITCTLR_TXCAEIM |  \
                                         ETH_MMC_TITCTLR_TXUGIM | ETH_MMC_TITCTLR_TXEDEIM);
    PMT_INTMASK = bCM_ETH->MAC_INTMSKR_b.PMTIM;
    PMT_INTSTSR  = bCM_ETH->MAC_INTSTSR_b.PMTIS;
    PTP_INTMASK = bCM_ETH->MAC_INTMSKR_b.TSPIM;
    PTP_INTSTSR  = bCM_ETH->MAC_INTSTSR_b.TSPIS;
    PTP_INTE    = bCM_ETH->PTP_TSPCTLR_b.TSPINT;

    DMA_DMASTSR = CM_ETH->DMA_DMASTSR & (ETH_DMA_DMASTSR_AIS | ETH_DMA_DMASTSR_NIS);
    DMA_INTENAR = CM_ETH->DMA_INTENAR & (ETH_DMA_INTENAR_AIE | ETH_DMA_INTENAR_NIE);
    if (0UL != (VSSEL140 & BIT_MASK_28)) {
        if ((0UL != (MMC_REVSTSR & (~MMC_RITCTLR))) ||                          \
            (0UL != (MMC_TRSSTSR & (~MMC_TITCTLR))) ||                          \
            (0UL != (PMT_INTSTSR & (~PMT_INTMASK))) ||                          \
            (0UL != (PTP_INTSTSR & (~PTP_INTMASK) & PTP_INTE)) ||               \
            (0UL != (DMA_DMASTSR & DMA_INTENAR))) {
            ETH_Global_IrqHandler();
        }
    }

    /* Ethernet wakeup */
    if (0UL == bCM_ETH->MAC_INTMSKR_b.PMTIM) {
        if ((1UL == bCM_ETH->MAC_INTSTSR_b.PMTIS) && (0UL != (VSSEL140 & BIT_MASK_29))) {
            ETH_Wakeup_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.141 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ141_Handler(void)
{
    const uint32_t VSSEL141 = CM_INTC->VSSEL141;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

