levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32f4a8_ll_interrupts_share.c
    /* I2S Ch.3 Tx */
    if (1UL == bCM_I2S3->CTRL_b.TXIE) {
        if ((1UL == bCM_I2S3->SR_b.TXBA) && (0UL != (VSSEL141 & BIT_MASK_00))) {
            I2S3_Tx_IrqHandler();
        }
    }
    /* I2S Ch.3 Rx */
    if (1UL == bCM_I2S3->CTRL_b.RXIE) {
        if ((1UL == bCM_I2S3->SR_b.RXBA) && (0UL != (VSSEL141 & BIT_MASK_01))) {
            I2S3_Rx_IrqHandler();
        }
    }
    /* I2S Ch.3 Error */
    if (1UL == bCM_I2S3->CTRL_b.EIE) {
        u32Tmp1 = CM_I2S3->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_02))) {
            I2S3_Error_IrqHandler();
        }
    }
    /* I2S Ch.4 Tx */
    if (1UL == bCM_I2S4->CTRL_b.TXIE) {
        if ((1UL == bCM_I2S4->SR_b.TXBA) && (0UL != (VSSEL141 & BIT_MASK_03))) {
            I2S4_Tx_IrqHandler();
        }
    }
    /* I2S Ch.4 Rx */
    if (1UL == bCM_I2S4->CTRL_b.RXIE) {
        if ((1UL == bCM_I2S4->SR_b.RXBA) && (0UL != (VSSEL141 & BIT_MASK_04))) {
            I2S4_Rx_IrqHandler();
        }
    }
    /* I2S Ch.4 Error */
    if (1UL == bCM_I2S4->CTRL_b.EIE) {
        u32Tmp1 = CM_I2S4->ER & (I2S_ER_TXERR | I2S_ER_RXERR);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_05))) {
            I2S4_Error_IrqHandler();
        }
    }
    if (1UL == bCM_USART9->CR1_b.RIE) {
        /* USART Ch.9 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART9->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_06))) {
            USART9_RxError_IrqHandler();
        }
        /* USART Ch.9 Rx end */
        if ((1UL == bCM_USART9->SR_b.RXNE) && (0UL != (VSSEL141 & BIT_MASK_07))) {
            USART9_RxFull_IrqHandler();
        }
    }
    /* USART Ch.9 Tx buffer empty */
    if (1UL == bCM_USART9->CR1_b.TXEIE) {
        if ((1UL == bCM_USART9->SR_b.TXE) && (0UL != (VSSEL141 & BIT_MASK_08))) {
            USART9_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.9 Tx end */
    if (1UL == bCM_USART9->CR1_b.TCIE) {
        if ((1UL == bCM_USART9->SR_b.TC) && (0UL != (VSSEL141 & BIT_MASK_09))) {
            USART9_TxComplete_IrqHandler();
        }
    }
    /* USART Ch.10 LIN bus break */
    if (1UL == bCM_USART10->CR2_b.LBDIE) {
        if ((1UL == bCM_USART10->SR_b.LBD) && (0UL != (VSSEL141 & BIT_MASK_10))) {
            USART10_LinBreakField_IrqHandler();
        }
    }
    /* USART Ch.10 LIN bus wakeup */
    if (1UL == bCM_USART10->CR2_b.WKUPE) {
        if ((1UL == bCM_USART10->SR_b.WKUP) && (0UL != (VSSEL141 & BIT_MASK_10))) {
            USART10_LinWakeup_IrqHandler();
        }
    }
    if (1UL == bCM_USART10->CR1_b.RIE) {
        /* USART Ch.10 Rx ORE/FE/PE error */
        u32Tmp1 = CM_USART10->SR & (USART_SR_PE | USART_SR_FE | USART_SR_ORE);
        if ((0UL != u32Tmp1) && (0UL != (VSSEL141 & BIT_MASK_11))) {
            USART10_RxError_IrqHandler();
        }
        /* USART Ch.10 Rx end */
        if ((1UL == bCM_USART10->SR_b.RXNE) && (0UL != (VSSEL141 & BIT_MASK_12))) {
            USART10_RxFull_IrqHandler();
        }
    }
    /* USART Ch.10 Tx buffer empty */
    if (1UL == bCM_USART10->CR1_b.TXEIE) {
        if ((1UL == bCM_USART10->SR_b.TXE) && (0UL != (VSSEL141 & BIT_MASK_13))) {
            USART10_TxEmpty_IrqHandler();
        }
    }
    /* USART Ch.10 Tx end */
    if (1UL == bCM_USART10->CR1_b.TCIE) {
        if ((1UL == bCM_USART10->SR_b.TC) && (0UL != (VSSEL141 & BIT_MASK_14))) {
            USART10_TxComplete_IrqHandler();
        }
    }
    /* SKE core done */
    if (1UL == bCM_SKE->CFG_b.IRQEN) {
        if ((1UL == bCM_SKE->SR2_b.CORE_DONE) && (0UL != (VSSEL141 & BIT_MASK_15))) {
            SKE_IrqHandler();
        }
    }
    /* I2C Ch.1 Rx end */
    if (1UL == bCM_I2C1->CR2_b.RFULLIE) {
        if ((1UL == bCM_I2C1->SR_b.RFULLF) && (0UL != (VSSEL141 & BIT_MASK_16))) {
            I2C1_RxFull_IrqHandler();
        }
    }
    /* I2C Ch.1 Tx buffer empty */
    if (1UL == bCM_I2C1->CR2_b.TEMPTYIE) {
        if ((1UL == bCM_I2C1->SR_b.TEMPTYF) && (0UL != (VSSEL141 & BIT_MASK_17))) {
            I2C1_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.1 Tx end */
    if (1UL == bCM_I2C1->CR2_b.TENDIE) {
        if ((1UL == bCM_I2C1->SR_b.TENDF) && (0UL != (VSSEL141 & BIT_MASK_18))) {
            I2C1_TxComplete_IrqHandler();
        }
    }
    /* I2C Ch.1 Error */
    u32Tmp1 = CM_I2C1->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMBHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = CM_I2C1->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL141 & BIT_MASK_19))) {
        I2C1_EE_IrqHandler();
    }
    /* I2C Ch.2 Rx end */
    if (1UL == bCM_I2C2->CR2_b.RFULLIE) {
        if ((1UL == bCM_I2C2->SR_b.RFULLF) && (0UL != (VSSEL141 & BIT_MASK_20))) {
            I2C2_RxFull_IrqHandler();
        }
    }
    /* I2C Ch.2 Tx buffer empty */
    if (1UL == bCM_I2C2->CR2_b.TEMPTYIE) {
        if ((1UL == bCM_I2C2->SR_b.TEMPTYF) && (0UL != (VSSEL141 & BIT_MASK_21))) {
            I2C2_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.2 Tx end */
    if (1UL == bCM_I2C2->CR2_b.TENDIE) {
        if ((1UL == bCM_I2C2->SR_b.TENDF) && (0UL != (VSSEL141 & BIT_MASK_22))) {
            I2C2_TxComplete_IrqHandler();
        }
    }
    /* I2C Ch.2 Error */
    u32Tmp1 = CM_I2C2->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMBHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = CM_I2C2->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL141 & BIT_MASK_23))) {
        I2C2_EE_IrqHandler();
    }
    /* I2C Ch.3 Rx end */
    if (1UL == bCM_I2C3->CR2_b.RFULLIE) {
        if ((1UL == bCM_I2C3->SR_b.RFULLF) && (0UL != (VSSEL141 & BIT_MASK_24))) {
            I2C3_RxFull_IrqHandler();
        }
    }
    /* I2C Ch.3 Tx buffer empty */
    if (1UL == bCM_I2C3->CR2_b.TEMPTYIE) {
        if ((1UL == bCM_I2C3->SR_b.TEMPTYF) && (0UL != (VSSEL141 & BIT_MASK_25))) {
            I2C3_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.3 Tx end */
    if (1UL == bCM_I2C3->CR2_b.TENDIE) {
        if ((1UL == bCM_I2C3->SR_b.TENDF) && (0UL != (VSSEL141 & BIT_MASK_26))) {
            I2C3_TxComplete_IrqHandler();
        }
    }
    /* I2C Ch.3 Error */
    u32Tmp1 = CM_I2C3->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMBHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = CM_I2C3->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL141 & BIT_MASK_27))) {
        I2C3_EE_IrqHandler();
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.142 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ142_Handler(void)
{
    const uint32_t VSSEL142 = CM_INTC->VSSEL142;
    uint32_t u32Tmp1;
    uint32_t u32Tmp2;

    /* I2C Ch.4 Rx end */
    if (1UL == bCM_I2C4->CR2_b.RFULLIE) {
        if ((1UL == bCM_I2C4->SR_b.RFULLF) && (0UL != (VSSEL142 & BIT_MASK_00))) {
            I2C4_RxFull_IrqHandler();
        }
    }
    /* I2C Ch.4 Tx buffer empty */
    if (1UL == bCM_I2C4->CR2_b.TEMPTYIE) {
        if ((1UL == bCM_I2C4->SR_b.TEMPTYF) && (0UL != (VSSEL142 & BIT_MASK_01))) {
            I2C4_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.4 Tx end */
    if (1UL == bCM_I2C4->CR2_b.TENDIE) {
        if ((1UL == bCM_I2C4->SR_b.TENDF) && (0UL != (VSSEL142 & BIT_MASK_02))) {
            I2C4_TxComplete_IrqHandler();
        }
    }
    /* I2C Ch.4 Error */
    u32Tmp1 = CM_I2C4->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMBHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = CM_I2C4->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL142 & BIT_MASK_03))) {
        I2C4_EE_IrqHandler();
    }
    /* I2C Ch.5 Rx end */
    if (1UL == bCM_I2C5->CR2_b.RFULLIE) {
        if ((1UL == bCM_I2C5->SR_b.RFULLF) && (0UL != (VSSEL142 & BIT_MASK_04))) {
            I2C5_RxFull_IrqHandler();
        }
    }
    /* I2C Ch.5 Tx buffer empty */
    if (1UL == bCM_I2C5->CR2_b.TEMPTYIE) {
        if ((1UL == bCM_I2C5->SR_b.TEMPTYF) && (0UL != (VSSEL142 & BIT_MASK_05))) {
            I2C5_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.5 Tx end */
    if (1UL == bCM_I2C5->CR2_b.TENDIE) {
        if ((1UL == bCM_I2C5->SR_b.TENDF) && (0UL != (VSSEL142 & BIT_MASK_06))) {
            I2C5_TxComplete_IrqHandler();
        }
    }
    /* I2C Ch.5 Error */
    u32Tmp1 = CM_I2C5->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMBHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = CM_I2C5->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL142 & BIT_MASK_07))) {
        I2C5_EE_IrqHandler();
    }
    /* I2C Ch.6 Rx end */
    if (1UL == bCM_I2C6->CR2_b.RFULLIE) {
        if ((1UL == bCM_I2C6->SR_b.RFULLF) && (0UL != (VSSEL142 & BIT_MASK_08))) {
            I2C6_RxFull_IrqHandler();
        }
    }
    /* I2C Ch.6 Tx buffer empty */
    if (1UL == bCM_I2C6->CR2_b.TEMPTYIE) {
        if ((1UL == bCM_I2C6->SR_b.TEMPTYF) && (0UL != (VSSEL142 & BIT_MASK_09))) {
            I2C6_TxEmpty_IrqHandler();
        }
    }
    /* I2C Ch.6 Tx end */
    if (1UL == bCM_I2C6->CR2_b.TENDIE) {
        if ((1UL == bCM_I2C6->SR_b.TENDF) && (0UL != (VSSEL142 & BIT_MASK_10))) {
            I2C6_TxComplete_IrqHandler();
        }
    }
    /* I2C Ch.6 Error */
    u32Tmp1 = CM_I2C6->CR2 & (I2C_CR2_SMBALRTIE | I2C_CR2_SMBHOSTIE | I2C_CR2_SMBDEFAULTIE | \
                              I2C_CR2_GENCALLIE | I2C_CR2_TMOUTIE  | I2C_CR2_NACKIE       | \
                              I2C_CR2_ARLOIE    | I2C_CR2_STOPIE   | I2C_CR2_SLADDR1IE    | \
                              I2C_CR2_SLADDR0IE | I2C_CR2_STARTIE);
    u32Tmp2 = CM_I2C6->SR & (I2C_SR_SMBALRTF | I2C_SR_SMBHOSTF | I2C_SR_SMBDEFAULTF |   \
                             I2C_SR_GENCALLF | I2C_SR_TMOUTF   | I2C_SR_NACKF       |   \
                             I2C_SR_ARLOF    | I2C_SR_STOPF    | I2C_SR_SLADDR1F    |   \
                             I2C_SR_SLADDR0F | I2C_SR_STARTF);
    if ((0UL != (u32Tmp1 & u32Tmp2)) && (0UL != (VSSEL142 & BIT_MASK_11))) {
        I2C6_EE_IrqHandler();
    }
    /* LVD Ch.1 */
    if (1UL == bCM_PWC->PVDCR1_b.PVD1IRE) {
        if ((1UL == bCM_PWC->PVDDSR_b.PVD1DETFLG) && (0UL != (VSSEL142 & BIT_MASK_13))) {
            PWC_LVD1_IrqHandler();
        }
    }
    /* LVD Ch.2 */
    if (1UL == bCM_PWC->PVDCR1_b.PVD2IRE) {
        if ((1UL == bCM_PWC->PVDDSR_b.PVD2DETFLG) && (0UL != (VSSEL142 & BIT_MASK_14))) {
            PWC_LVD2_IrqHandler();
        }
    }
    /* FCM Ch.1 error */
    if (1UL == bCM_FCM1->RIER_b.ERRIE) {
        if ((1UL == bCM_FCM_COM->SR_b.ERRF1) && (0UL != (VSSEL142 & BIT_MASK_16))) {
            FCM1_Error_IrqHandler();
        }
    }
    /* FCM Ch.1 end */
    if (1UL == bCM_FCM1->RIER_b.MENDIE) {
        if ((1UL == bCM_FCM_COM->SR_b.MENDF1) && (0UL != (VSSEL142 & BIT_MASK_17))) {
            FCM1_End_IrqHandler();
        }
    }
    /* FCM Ch.1 overflow */
    if (1UL == bCM_FCM1->RIER_b.OVFIE) {
        if ((1UL == bCM_FCM_COM->SR_b.OVF1) && (0UL != (VSSEL142 & BIT_MASK_18))) {
            FCM1_Ovf_IrqHandler();
        }
    }
    /* FCM Ch.2 error */
    if (1UL == bCM_FCM2->RIER_b.ERRIE) {
        if ((1UL == bCM_FCM_COM->SR_b.ERRF2) && (0UL != (VSSEL142 & BIT_MASK_16))) {
            FCM2_Error_IrqHandler();
        }
    }
    /* FCM Ch.2 end */
    if (1UL == bCM_FCM2->RIER_b.MENDIE) {
        if ((1UL == bCM_FCM_COM->SR_b.MENDF2) && (0UL != (VSSEL142 & BIT_MASK_17))) {
            FCM2_End_IrqHandler();
        }
    }
    /* FCM Ch.2 overflow */
    if (1UL == bCM_FCM2->RIER_b.OVFIE) {
        if ((1UL == bCM_FCM_COM->SR_b.OVF2) && (0UL != (VSSEL142 & BIT_MASK_18))) {
            FCM2_Ovf_IrqHandler();
        }
    }
    /* FCM Ch.3 error */
    if (1UL == bCM_FCM3->RIER_b.ERRIE) {
        if ((1UL == bCM_FCM_COM->SR_b.ERRF3) && (0UL != (VSSEL142 & BIT_MASK_16))) {
            FCM3_Error_IrqHandler();
        }
    }
    /* FCM Ch.3 end */
    if (1UL == bCM_FCM3->RIER_b.MENDIE) {
        if ((1UL == bCM_FCM_COM->SR_b.MENDF3) && (0UL != (VSSEL142 & BIT_MASK_17))) {
            FCM3_End_IrqHandler();
        }
    }
    /* FCM Ch.3 overflow */
    if (1UL == bCM_FCM3->RIER_b.OVFIE) {
        if ((1UL == bCM_FCM_COM->SR_b.OVF3) && (0UL != (VSSEL142 & BIT_MASK_18))) {
            FCM3_Ovf_IrqHandler();
        }
    }
    /* FCM Ch.4 error */
    if (1UL == bCM_FCM4->RIER_b.ERRIE) {
        if ((1UL == bCM_FCM_COM->SR_b.ERRF4) && (0UL != (VSSEL142 & BIT_MASK_16))) {
            FCM4_Error_IrqHandler();
        }
    }
    /* FCM Ch.4 end */
    if (1UL == bCM_FCM4->RIER_b.MENDIE) {
        if ((1UL == bCM_FCM_COM->SR_b.MENDF4) && (0UL != (VSSEL142 & BIT_MASK_17))) {
            FCM4_End_IrqHandler();
        }
    }
    /* FCM Ch.4 overflow */
    if (1UL == bCM_FCM4->RIER_b.OVFIE) {
        if ((1UL == bCM_FCM_COM->SR_b.OVF4) && (0UL != (VSSEL142 & BIT_MASK_18))) {
            FCM4_Ovf_IrqHandler();
        }
    }
    /* WDT underflow or refresh error */
    u32Tmp1 = CM_WDT->SR & (WDT_SR_UDF | WDT_SR_REF);
    if ((0UL != u32Tmp1) && (0UL != (VSSEL142 & BIT_MASK_19))) {
        WDT_IrqHandler();
    }
    /* CTC overflow or underflow error */
    if (1UL == bCM_CTC->CR1_b.ERRIE) {
        /* underflow */
        if ((1UL == bCM_CTC->STR_b.TRMUDF) && (0UL != (VSSEL142 & BIT_MASK_20))) {
            CTC_Udf_IrqHandler();
        }
        /* overflow */
        if ((1UL == bCM_CTC->STR_b.TRMOVF) && (0UL != (VSSEL142 & BIT_MASK_20))) {
            CTC_Ovf_IrqHandler();
        }
    }
    /* USART Ch.1 Tx end */
    if (1UL == bCM_USART1->CR1_b.TENDIE) {
        if ((1UL == bCM_USART1->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_22))) {
            USART1_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.2 Tx end */
    if (1UL == bCM_USART2->CR1_b.TENDIE) {
        if ((1UL == bCM_USART2->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_23))) {
            USART2_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.3 Tx end */
    if (1UL == bCM_USART3->CR1_b.TENDIE) {
        if ((1UL == bCM_USART3->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_24))) {
            USART3_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.4 Tx end */
    if (1UL == bCM_USART4->CR1_b.TENDIE) {
        if ((1UL == bCM_USART4->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_25))) {
            USART4_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.5 Tx end */
    if (1UL == bCM_USART5->CR1_b.TENDIE) {
        if ((1UL == bCM_USART5->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_26))) {
            USART5_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.6 Tx end */
    if (1UL == bCM_USART6->CR1_b.TENDIE) {
        if ((1UL == bCM_USART6->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_27))) {
            USART6_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.7 Tx end */
    if (1UL == bCM_USART7->CR1_b.TENDIE) {
        if ((1UL == bCM_USART7->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_28))) {
            USART7_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.8 Tx end */
    if (1UL == bCM_USART8->CR1_b.TENDIE) {
        if ((1UL == bCM_USART8->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_29))) {
            USART8_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.9 Tx end */
    if (1UL == bCM_USART9->CR1_b.TENDIE) {
        if ((1UL == bCM_USART9->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_30))) {
            USART9_TxEnd_IrqHandler();
        }
    }
    /* USART Ch.10 Tx end */
    if (1UL == bCM_USART10->CR1_b.TENDIE) {
        if ((1UL == bCM_USART10->SR_b.TEND) && (0UL != (VSSEL142 & BIT_MASK_31))) {
            USART10_TxEnd_IrqHandler();
        }
    }

    /* Arm Errata 838869: Cortex-M4, Cortex-M4F */
    __DSB();
}

/**
 * @brief  Interrupt No.143 share IRQ handler
 * @param  None
 * @retval None
 */
void IRQ143_Handler(void)
{
    const uint32_t VSSEL143 = CM_INTC->VSSEL143;
    uint32_t u32Tmp1;

    /* ADC unit1 sequence A */
    if (1UL == bCM_ADC1->ICR_b.EOCAIEN) {
        if ((1UL == bCM_ADC1->ISR_b.EOCAF) && (0UL != (VSSEL143 & BIT_MASK_00))) {
            ADC1_SeqA_IrqHandler();
        }
    }
    /* ADC unit1 sequence B */
    if (1UL == bCM_ADC1->ICR_b.EOCBIEN) {
        if ((1UL == bCM_ADC1->ISR_b.EOCBF) && (0UL != (VSSEL143 & BIT_MASK_01))) {
            ADC1_SeqB_IrqHandler();
        }
    }
    /* ADC unit1 window 0 compare */
    if (1UL == bCM_ADC1->AWDCR_b.AWD0IEN) {
        if ((1UL == bCM_ADC1->AWDSR_b.AWD0F) && (0UL != (VSSEL143 & BIT_MASK_02))) {
            ADC1_Cmp0_IrqHandler();
        }
    }
    /* ADC unit1 window 1 compare */
    if (1UL == bCM_ADC1->AWDCR_b.AWD1IEN) {
        /* independence use */
        u32Tmp1 = (uint16_t)(CM_ADC1->AWDCR & ADC_AWDCR_AWDCM);
        if ((1UL == bCM_ADC1->AWDSR_b.AWD1F) && (0UL == u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_03))) {
            ADC1_Cmp1_IrqHandler();
        }
        /* combination use */
        if ((1UL == bCM_ADC1->AWDSR_b.AWDCMF) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_03))) {
            ADC1_CmpComb_IrqHandler();
        }
    }
    /* ADC unit2 sequence A */
    if (1UL == bCM_ADC2->ICR_b.EOCAIEN) {
        if ((1UL == bCM_ADC2->ISR_b.EOCAF) && (0UL != (VSSEL143 & BIT_MASK_04))) {
            ADC2_SeqA_IrqHandler();
        }
    }
    /* ADC unit2 sequence B */
    if (1UL == bCM_ADC2->ICR_b.EOCBIEN) {
        if ((1UL == bCM_ADC2->ISR_b.EOCBF) && (0UL != (VSSEL143 & BIT_MASK_05))) {
            ADC2_SeqB_IrqHandler();
        }
    }
    /* ADC unit2 window 0 compare */
    if (1UL == bCM_ADC2->AWDCR_b.AWD0IEN) {
        if ((1UL == bCM_ADC2->AWDSR_b.AWD0F) && (0UL != (VSSEL143 & BIT_MASK_06))) {
            ADC2_Cmp0_IrqHandler();
        }
    }
    /* ADC unit2 window 1 compare */
    if (1UL == bCM_ADC2->AWDCR_b.AWD1IEN) {
        /* independence use */
        u32Tmp1 = ((uint16_t)(CM_ADC2->AWDCR & ADC_AWDCR_AWDCM));
        if ((1UL == bCM_ADC2->AWDSR_b.AWD1F) && (0UL == u32Tmp1) && (0UL != (0UL != (VSSEL143 & BIT_MASK_07)))) {
            ADC2_Cmp1_IrqHandler();
        }
        /* combination use */
        if ((1UL == bCM_ADC2->AWDSR_b.AWDCMF) && (0UL != u32Tmp1) && (0UL != (0UL != (VSSEL143 & BIT_MASK_07)))) {
            ADC2_CmpComb_IrqHandler();
        }
    }
    /* ADC unit3 sequence A */
    if (1UL == bCM_ADC3->ICR_b.EOCAIEN) {
        if ((1UL == bCM_ADC3->ISR_b.EOCAF) && (0UL != (VSSEL143 & BIT_MASK_08))) {
            ADC3_SeqA_IrqHandler();
        }
    }
    /* ADC unit3 sequence B */
    if (1UL == bCM_ADC3->ICR_b.EOCBIEN) {
        if ((1UL == bCM_ADC3->ISR_b.EOCBF) && (0UL != (VSSEL143 & BIT_MASK_09))) {
            ADC3_SeqB_IrqHandler();
        }
    }
    /* ADC unit3 window 0 compare */
    if (1UL == bCM_ADC3->AWDCR_b.AWD0IEN) {
        if ((1UL == bCM_ADC3->AWDSR_b.AWD0F) && (0UL != (VSSEL143 & BIT_MASK_10))) {
            ADC3_Cmp0_IrqHandler();
        }
    }
    /* ADC unit3 window 1 compare */
    if (1UL == bCM_ADC3->AWDCR_b.AWD1IEN) {
        /* independence use */
        u32Tmp1 = (uint16_t)(CM_ADC3->AWDCR & ADC_AWDCR_AWDCM);
        if ((1UL == bCM_ADC3->AWDSR_b.AWD1F) && (0UL == u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_11))) {
            ADC3_Cmp1_IrqHandler();
        }
        /* combination use */
        if ((1UL == bCM_ADC3->AWDSR_b.AWDCMF) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_11))) {
            ADC3_CmpComb_IrqHandler();
        }
    }
    /* CAN1 RAM ECC error */
    u32Tmp1 = CM_CAN1->RAM_CKCR & CAN_RAM_CKCR_ECCMOD;
    if (0UL != (VSSEL143 & BIT_MASK_13)) {
        if (((1UL == bCM_CAN1->RAM_CKSR_b.RAM_1ERR) && (u32Tmp1 == 0x3UL)) || \
            ((1UL == bCM_CAN1->RAM_CKSR_b.RAM_2ERR) && (u32Tmp1 != 0UL))) {
            CAN1RAM_EccError_IrqHandler();
        }
    }
    /* CAN2 RAM ECC error */
    u32Tmp1 = CM_CAN2->RAM_CKCR & CAN_RAM_CKCR_ECCMOD;
    if (0UL != (VSSEL143 & BIT_MASK_14)) {
        if (((1UL == bCM_CAN2->RAM_CKSR_b.RAM_1ERR) && (u32Tmp1 == 0x3UL)) || \
            ((1UL == bCM_CAN2->RAM_CKSR_b.RAM_2ERR) && (u32Tmp1 != 0UL))) {
            CAN2RAM_EccError_IrqHandler();
        }
    }
    /* MCANRAM ECC error */
    u32Tmp1 = CM_MCANRAM->CKCR & MCANRAM_CKCR_ECCMOD;
    if (0UL != (VSSEL143 & BIT_MASK_15)) {
        if (((1UL == bCM_MCANRAM->CKSR_b.RAM_1ERR) && (u32Tmp1 == 0x3UL)) || \
            ((1UL == bCM_MCANRAM->CKSR_b.RAM_2ERR) && (u32Tmp1 != 0UL))) {
            MCANRAM_EccError_IrqHandler();
        }
    }
    /* NFC */
    if (0UL != (VSSEL143 & BIT_MASK_16)) {
        if (0UL != (CM_NFC->IRSR & (NFC_IRSR_RBRS | NFC_IRSR_ECCERS |           \
                                    NFC_IRSR_ECCCRS | NFC_IRSR_ECCECRS | NFC_IRSR_ECCEURS))) {
            NFC_IrqHandler();
        }
    }
    /* MCAN1 INT0 INT1 */
    u32Tmp1 = CM_MCAN1->IR & 0x3FFFFFFFUL;
    if ((1UL == bCM_MCAN1->ILE_b.EINT0) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_17))) {
        MCAN1_Int0_IrqHandler();
    }
    if ((1UL == bCM_MCAN1->ILE_b.EINT1) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_18))) {
        MCAN1_Int1_IrqHandler();
    }
    /* MCAN2 INT0 INT1 */
    u32Tmp1 = CM_MCAN2->IR & 0x3FFFFFFFUL;
    if ((1UL == bCM_MCAN2->ILE_b.EINT0) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_19))) {
        MCAN2_Int0_IrqHandler();
    }
    if ((1UL == bCM_MCAN2->ILE_b.EINT1) && (0UL != u32Tmp1) && (0UL != (VSSEL143 & BIT_MASK_20))) {
        MCAN2_Int1_IrqHandler();
    }

